перем ПутьКФайлу;
Перем База,ЕстьПодключение;
перем КаталогЗагрузки ;
перем МассивДат ;
Перем в8;

Функция НайтиАтомобиль(НомерЭК,ГСМ,МассивОшибок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Ссылка,
	|	Автомобили.ГСМ
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО Автомобили.Ссылка = ОсновныеСредства.Автомобиль
	|ГДЕ
	|	Автомобили.НомерЭК = &НомерЭК
	|	И Автомобили.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ОсновныеСредства.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("НомерЭК", Число(НомерЭК));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	колЗ = ВыборкаДетальныеЗаписи.Количество();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если колЗ=1 тогда
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		ИначеЕсли ВыборкаДетальныеЗаписи.ГСМ =ГСМ тогда
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
	ТекстОшибки = "В справочнике Автомобили не найдена карта с № "+НомерЭК + " с топливом "+Строка(ГСМ);
	Если МассивОшибок.Найти(ТекстОшибки)= Неопределено тогда
		МассивОшибок.добавить(ТекстОшибки);
	КонецЕсли;	
	//сообщить(ТекстОшибки) ;
	Возврат Неопределено;	
конецФункции	

Процедура ВыполнитьЗагрузкиИзФаилавТЗ()
	ПутьКФайлу="";
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.Фильтр = "Текстовые файлы(*.txt;*.txt)|*.txt;*.txt";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.ПолноеИмяФайла = ПутьКФайлу;
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
	НачалоПериода  = ТекущаяДата();
	КонецПериода   = ТекущаяДата();
	
	стр = "" ;
	УНН="";
	Получатель=ложь;
	Если ПутьКФайлу<>"" тогда
		Заправки.Очистить();
		Текст = Новый ЧтениеТекста(ПутьКФайлу,КодировкаТекста.ANSI);
		Пока стр <> Неопределено Цикл
			стр = Текст.ПрочитатьСтроку()    ;
			
			Если Найти(Стр,"за период с 20")<>0 тогда
				Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
				год = Лев(Массив[3],4);
				МесяцН = сред(Массив[3],6,2)  ;
				ДеньН = прав(Массив[3],2);	
				НачалоПериода = Дата(год,МесяцН,ДеньН)  ;
				
				МесяцК = сред(Массив[5],6,2)  ;
				ДеньК = прав(Массив[5],2);	
				КонецПериода = Дата( Лев(Массив[5],4),МесяцК,ДеньК)  ;
				
			ИначеЕсли  УНН="" тогда
				Если 	Найти(Стр,"Получатель:")<>0  тогда
					Получатель=истина;
				ИначеЕсли Найти(Стр,"УНН")<>0 и Получатель тогда
					Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
					
					Если Массив[3] ="УНК" Тогда
						Организация =  Справочники.Организации.НайтиПоРеквизиту("ИНН",Массив[2])
					Иначе	
						Организация =  Справочники.Организации.НайтиПоРеквизиту("ИНН",Массив[3]);
					КонецЕсли; 
					
					Прервать;	
				КонецЕсли;	
			конецЕсли;	
			
			
		КонецЦикла;		
		
		
		Если Организация.Пустая() тогда
			Предупреждение("Не найдена Органозация, не загрузится.");
			возврат;
		КонецЕсли;   
		МассивОшибок = новый Массив;
	
		стр = "" ;
		Пока стр <> Неопределено Цикл
			стр = Текст.ПрочитатьСтроку()    ;
			//Попытка
			//	День = Число(Лев(стр,2));
			//	Месяц = Число(Сред(Стр,4,2));
			//	Год = Число(Прав(стр,2));
			//Исключение
			//КонецПопытки;
			//Массивдат.Добавить(Дата(2000+Год,Месяц,День));
			
			Если Найти(Стр,"ИТОГО")<>0 тогда
				Прервать;
			конецЕсли;
			
			Если  Найти(Стр,"Итого по н/п") <>0 тогда
				//НомерЭК=Неопределено;
				Продолжить;
			КонецЕсли;	
			
			Если  Найти(Стр,"Итого по э/к") <>0 тогда
				НомерЭК=Неопределено;
				Продолжить;
			КонецЕсли;	

			
			
			ЕСли врег(лев(СокрЛП(стр),3))="Э/К" тогда
				Состояние(стр);
				Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
				НомерЭК= Массив[1];
				Если Найти("0123456789",Лев(номерЭК,1))=0 тогда
					продолжить;
				КонецЕсли;	
				Продолжить;
			КонецЕсли;
			
			Если НомерЭК<>Неопределено тогда
				Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
				если Массив.количество()<8 Тогда
					Продолжить;	
				конецЕсли;
				
				//Если сокрЛП(НомерЭК)<>"653000168" тогда
				//	Продолжить;
				//КонецЕсли;
				////	Год  = год(ТекущаяДата());
				Месяц = Лев(Массив[0],2)    ;
				день = прав(Массив[0],2);
				Время = Число(СтрЗаменить(Массив[1],":",","));
				СтрЗ =	Заправки.Добавить();
				
				Если  Найти(Массив[9],"АИ-95")<> 0 тогда 
					//Массив[9]="АИ-95-K5" или Массив[9]="АИ-95-К5" или  Массив[9]="АИ-95-К5-Е" тогда
					СтрЗ.ГСМ = Справочники.Номенклатура.НайтиПоКоду("ШПЧ00006552");//НайтиПоНаименованию("АИ-95",истина);
				ИначеЕсли Найти(Массив[9],"ДТ-")<> 0 тогда 
					// Массив[9]="ДТ-Л-К5"  тогда
					СтрЗ.ГСМ = Справочники.Номенклатура.НайтиПоКоду("ШПЧ00006548");
				ИначеЕсли  Найти(Массив[9],"АИ-92")<> 0 тогда 
                    // Массив[9]="АИ-92-К5"  тогда
					СтрЗ.ГСМ = Справочники.Номенклатура.НайтиПоКоду("ШПЧ00006551");//НайтиПоНаименованию("АИ-92",истина);
				ИначеЕсли  Найти(Массив[9],"АИ-98")<> 0 тогда 
                    // Массив[9]="АИ-92-К5"  тогда
					СтрЗ.ГСМ = Справочники.Номенклатура.НайтиПоКоду("ЭКС00001094");//НайтиПоНаименованию("АИ-98",истина);
			
				КонецЕсли;
				СтрЗ.НомерЭК    = НомерЭК ;
				СтрЗ.Автомобиль = НайтиАтомобиль(НомерЭК,СтрЗ.ГСМ,МассивОшибок);///Автомобиль;	
				СтрЗ.Водитель   = СтрЗ.Автомобиль.Водитель;
				СтрЗ.Время      = Время;
				СтрЗ.Дата       = Дата(год,месяц,день);
				СтрЗ.Период     = НачалоМесяца(СтрЗ.Дата);
				СтрЗ.Получено   = Массив[5];
				СтрЗ.Сумма      = Массив[7];
						
				//стрз.ГСМ =  СтрЗ.Автомобиль.ГСМ;   АИ-92-К5
				//ИначеЕсли  УНН="" тогда
				//	Если 	Найти(Стр,"Получатель:")<>0  тогда
				//		Получатель=истина;
				//	ИначеЕсли Найти(Стр,"УНН")<>0 и Получатель тогда
				//		Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
				//		Организация =  Справочники.Организации.НайтиПоРеквизиту("ИНН",Массив[3]);
				//	КонецЕсли;	
			конецЕсли;	
			
			
		КонецЦикла;
		Текст.Закрыть();
		
		для каждого стр из МассивОшибок цикл
		Сообщить(стр);	
		КонецЦикла;	
		
	КонецЕсли;
	тз =	Заправки.Выгрузить(,"НомерЭК,Водитель,Период,ГСМ,Автомобиль");
	ТЗ.Свернуть("НомерЭК,Водитель,Период,ГСМ,Автомобиль","");
	Карты.Загрузить(ТЗ);
	
	Если ТЗ.Количество()<>0 тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Водитель,
		|	ТЗ.НомерЭК,
		|	НАЧАЛОПЕРИОДА(ТЗ.Период, МЕСЯЦ) КАК Период,
		|	ТЗ.ГСМ,
		|	ТЗ.Автомобиль
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Водитель КАК Водитель,
		|	ТЗ.НомерЭК КАК НомерЭК,
		|	ВложенныйЗапрос.Ссылка КАК ПутевойЛист,
		|	ТЗ.Период,
		|	ТЗ.ГСМ,
		|	ТЗ.Автомобиль
		|ИЗ
		|	ТЗ КАК ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПутевойЛист.Ссылка КАК Ссылка,
		|			ПутевойЛист.Водитель КАК Водитель,
		|			НАЧАЛОПЕРИОДА(ПутевойЛист.Дата, МЕСЯЦ) КАК Период
		|		ИЗ
		|			Документ.ПутевойЛист КАК ПутевойЛист
		|		ГДЕ
		|			ПутевойЛист.Организация = &Организация
		|           и ПутевойЛист.Водитель <> &ВодительПустая
		|			И ПутевойЛист.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			И (ПутевойЛист.Водитель, НАЧАЛОПЕРИОДА(ПутевойЛист.Дата, МЕСЯЦ)) В
		|					(ВЫБРАТЬ
		|						ТЗ.Водитель,
		|						ТЗ.Период
		|					ИЗ
		|						ТЗ КАК ТЗ)
		|			И ПутевойЛист.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		|		ПО ТЗ.Водитель = ВложенныйЗапрос.Водитель
		|			И ТЗ.Период = ВложенныйЗапрос.Период";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
			Запрос.УстановитьПараметр("ВодительПустая", Справочники.ФизическиеЛица.ПустаяСсылка());

		
		Карты.Очистить();
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		Если ТЗ1.Количество()<>0 тогда
			для каждого стр из ТЗ1 цикл
				ОтборК= Новый Структура("НомерЭК,Водитель,Период",стр.НомерЭК,стр.Водитель,стр.Период);  
				СТрокиОтбК= Карты.НайтиСтроки(ОтборК);
				Если СТрокиОтбК.Количество()<>0 Тогда
					продолжить;	
				КонецЕсли;	
				ТзК = Карты.Добавить();	
				ЗаполнитьЗначенияСвойств(ТзК,стр);
			КонецЦикла;
			//Карты.Загрузить(ТЗ1);
		КонецЕсли;
		состояние("Создание новых документов ПЛ.");
		для каждого стр из Карты цикл
			ТекД = стр;
			Если стр.Водитель.Пустая() тогда
				продолжить;
			конецЕсли;	
			если не ЗначениеЗаполнено(ТекД.ПутевойЛист) тогда 
				СсылкаНаДокумент   = 	  СоздатьПутевой(ТекД);
				ТекД.ПутевойЛист = СсылкаНаДокумент;
			КонецЕсли;
			//Если не ТекД.ПутевойЛист.Пустая() тогда
			//	ЗаполнитьДокументуПоТабелю(ТекД.ПутевойЛист);
			//КонецЕсли;	 
		КонецЦикла;
		
		
		
	конецЕсли;
	
	
	Сообщить("Загружен файл "+ПутьКФайлу);
	
	
	
КонецПроцедуры

Процедура ОтборПоНомеруКарты(ИмяРеквизитаСписка,ИмяОтбора,НомерКарты);
	ЭлементыФормы[ИмяРеквизитаСписка].ОтборСтрок[ИмяОтбора].ВидСравнения  = ВидСравнения.Равно;
	ЭлементыФормы[ИмяРеквизитаСписка].ОтборСтрок[ИмяОтбора].Использование = Истина;
	ЭлементыФормы[ИмяРеквизитаСписка].ОтборСтрок[ИмяОтбора].Значение      = НомерКарты;
	
КонецПроцедуры	


Процедура КоманднаяПанель1ЗагрузитьИзФаила(Кнопка)
	// Вставить содержимое обработчика.
	
	ЗаправкиНеРаспределенные.Очистить();
	ВыполнитьЗагрузкиИзФаилавТЗ();
	Если Карты.Количество()<>0 тогда
		ЭлементыФормы.Карты.ТекущаяСтрока = Карты[Карты.Количество()-1];  
		текс  = ЭлементыФормы.Карты.ТекущиеДанные;
		//ОтборПоНомеруКарты("Карты","НомерЭК","652014565");
		
		ОтборПоНомеруКарты("Заправки","НомерЭК",текс.НомерЭК);
		ОтборПоНомеруКарты("Заправки","Период",текс.Период);
		
		
	КонецЕсли;
	
	//ЭлементыФормы.Заправки.Колонки.Получено.ТекстПодвала = Заправки.Итог("Получено");
	ОбновитьПодвалЗаправкиПолучено();

	
КонецПроцедуры

Процедура КартыПриАктивизацииСтроки(Элемент)
	
	текс  = ЭлементыФормы.Карты.ТекущиеДанные;
	ОтборПоНомеруКарты("Заправки","НомерЭК",текс.НомерЭК);
	ОтборПоНомеруКарты("Заправки","Период",текс.Период);
	
	ОбновитьПодвалЗаправкиПолучено();
	
КонецПроцедуры

Процедура КоманднаяПанельДокументыДляИмпортаУстановитьФлажки(Кнопка)
	
	Для Каждого СтрокаДокумента из Карты Цикл
		СтрокаДокумента.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура КоманднаяПанельДокументыДляИмпортаСнятьФлажки(Кнопка)
	
	Для Каждого СтрокаДокумента из Карты Цикл
		СтрокаДокумента.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры


Процедура КоманднаяПанель2ЗагрузитьВдокументы(Кнопка)
	ЗаправкиНеРаспределенные.Очистить();
	
	ЗПр=  Заправки.Выгрузить();
	ЗПр.ЗаполнитьЗначения("","ПутевойЛист");
	Заправки.Загрузить(ЗПР);
	ЗПР="";
	Если НеОбновлятьТабельныеДанные = ложь тогда
		для каждого стр из Карты цикл
			ТекД = стр;
			Если стр.Водитель.Пустая() или стр.Пометка=Ложь тогда
				продолжить;
			конецЕсли;	
			Если не ТекД.ПутевойЛист.Пустая() тогда
				ЗаполнитьДокументуПоТабелю(ТекД);
			КонецЕсли;	 
		КонецЦикла;
	КонецЕсли;
	
	//НеобращатьВниманиенаВидТоплива Для холдинга = истина
	//Костыль чтобы не трогать алгоритм 
	
	НеОбращатьВниманиенаВидТоплива = Истина;

	для каждого стр из Карты цикл 
		Если стр.Пометка=Истина тогда
			Если стр.ПутевойЛист.Пустая() тогда
				Продолжить;
			конецЕсли;	
			ЭтоДоставщик =	стр.Водитель.СтатусКатегория = справочники.КатегорииЗастрахованныхЛиц.НайтиПоНаименованию("Доставка");

			Есть=ложь;

			ТЗпл = стр.ПутевойЛист.ВыполнениеЗадания.Выгрузить();
			ТЗпл.ЗаполнитьЗначения(0,"Получено");
			отбор = Новый Структура("НомерЭК,Период",стр.НомерЭК,стр.Период);
			стрЗаправки = Заправки.НайтиСтроки(отбор); 
			Для каждого стрЗ из стрЗаправки цикл
				отборПЛ  = Новый Структура("Дата",стрЗ.Дата);
				стрПЛ    = ТЗпл.НайтиСтроки(отборПЛ);
				ЕстьДата = Ложь;
				Если стр.ДатаУвольнения<>Дата(1,1,1) и стр.ДатаУвольнения< стрЗ.Дата тогда
					Сообщить(строка(стрЗ.Дата) + " - Топливо заправки. "+стрЗ.НомерЭК+" Исключена, дата увольненеия "+стр.ДатаУвольнения+" № "+ Строка(стр.ПутевойЛист) );
					
					стрЗР             =	ЗаправкиНеРаспределенные.Добавить();
					стрЗР.Автомобиль  = стрЗ.Автомобиль;
					стрЗР.Водитель    = стрЗ.Водитель;
					стрЗР.Дата        = стрЗ.Дата;
					стрЗР.ГСМ         = стрЗ.ГСМ;
					стрЗР.НомерЭК     = стрЗ.НомерЭК;
					стрЗР.Период      = стрЗ.Период;
					стрЗР.Получено    = стрЗ.Получено; 
					стрЗР.ПутевойЛист = стр.ПутевойЛист; 
					
					
				ИначеЕсли стр.ГСМ = стрЗ.ГСМ ИЛИ НеОбращатьВниманиенаВидТоплива Тогда	
						Для Каждого сПЛ из стрПЛ Цикл
							
						Если ИсключатьВыходныеЗаправки = Истина и ЭтоДоставщик тогда
							Если сПЛ.ВидДня <>  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий тогда
								
								СледДень = ТЗпл[Мин(ТЗпл.индекс(Спл)+1,ТЗпл.Количество()-1)];
								
								Если СледДень.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И стрЗ.Время > 22 ТОГДА
									/// Заправился в выходной вечером- следующий день рабочий;	
								иначе	
									
									Если стрЗ.получено <> 0 Тогда
										Состояние(строка(стрЗ.Дата) + " - нарушение УК РБ ст. № "+ Строка(стр.ПутевойЛист) );
										стрЗР             =	ЗаправкиНеРаспределенные.Добавить();
										стрЗР.Автомобиль  = стрЗ.Автомобиль;
										стрЗР.Водитель    = стрЗ.Водитель;
										стрЗР.Дата        = стрЗ.Дата;
										стрЗР.ГСМ         = стрЗ.ГСМ;
										стрЗР.НомерЭК     = стрЗ.НомерЭК;
										стрЗР.Период      = стрЗ.Период;
										стрЗР.Получено    = стрЗ.Получено; 
										стрЗР.ПутевойЛист = стр.ПутевойЛист; 
										
										//НайтиПодходящиеПутевыеДляНераспределенных(стрЗР)    ;
									КонецЕсли;	
									
									// закаментировать если надо чтобы сразу не разносило
									//         сПЛ.Получено =сПЛ.Получено+  стрЗ.Получено;
									// закаментировать если надо чтобы сразу не разносило
									
									Продолжить;
								КонецЕсли;	
							КонецЕсли;	    
						КонецЕсли;	
						
						Если сПЛ.Получено+стрЗ.Получено > 50 и ЭтоДоставщик тогда
							Сообщить(строка(стрЗ.Дата) + " - Топливо заправки. "+стрЗ.НомерЭК+" Исключена, заправлено больше 50 литров за день "+стр.ДатаУвольнения+" № "+ Строка(стр.ПутевойЛист) );
							стрЗР             =	ЗаправкиНеРаспределенные.Добавить();
							стрЗР.Автомобиль  = стрЗ.Автомобиль;
							стрЗР.Водитель    = стрЗ.Водитель;
							стрЗР.Дата        = стрЗ.Дата;
							стрЗР.ГСМ         = стрЗ.ГСМ;
							стрЗР.НомерЭК     = стрЗ.НомерЭК;
							стрЗР.Период      = стрЗ.Период;
							стрЗР.Получено    = стрЗ.Получено; 
							стрЗР.ПутевойЛист = стр.ПутевойЛист; 
							
							// закаментировать если надо чтобы сразу не разносило
							//		сПЛ.Получено =сПЛ.Получено+  стрЗ.Получено;
							// закаментировать если надо чтобы сразу не разносило
									
							 Продолжить;
						Иначе
							сПЛ.Получено = сПЛ.Получено + стрЗ.Получено;
						КонецЕсли;
						
						Есть     = Истина;
						ЕстьДата = Истина;
						
					КонецЦикла;
				иначе
					Сообщить(строка(стрЗ.Дата) + " - Топливо заправки. "+стрЗ.НомерЭК+"  не совпадает с топливом Авто. № "+ Строка(стр.ПутевойЛист) );
					стрЗР =	ЗаправкиНеРаспределенные.Добавить();
					стрЗР.Автомобиль = стрЗ.Автомобиль;
					стрЗР.Водитель =стрЗ.Водитель;
					стрЗР.Дата = стрЗ.Дата;
					стрЗР.ГСМ = стрЗ.ГСМ;
					стрЗР.НомерЭК = стрЗ.НомерЭК;
					стрЗР.Период=   стрЗ.Период;
					стрЗР.Получено = стрЗ.Получено; 
					стрЗР.ПутевойЛист = стр.ПутевойЛист; 
				конецЕсли;
				Если 	ЕстьДата=Истина тогда
				стрЗ.ПутевойЛист =  стр.ПутевойЛист;
			КонецЕсли;
		КонецЦикла;
			//Если Есть тогда
				об =  стр.ПутевойЛист.ПолучитьОбъект();
				об.ОстатокТопливаНаНачало = ПолучитьОстатокТоплева(,стр.ПутевойЛист);
				об.ВыполнениеЗадания.Загрузить(ТЗпл);
				об.Записать();
				стр.Получено= ТЗпл.Итог("Получено");
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
ЭтоДоставщик = справочники.КатегорииЗастрахованныхЛиц.НайтиПоНаименованию("Доставка");
	
	для каждого стр из ЗаправкиНеРаспределенные цикл 
		//Если стр.Пометка=Истина тогда
		Если не стр.ПутевойЛист.Пустая() и 	стр.Водитель.СтатусКатегория = ЭтоДоставщик тогда
			НайтиПодходящиеПутевыеДляНераспределенных(стр) ;
		конецЕсли;	
	КонецЦикла;
	
	
	сс=1;
	ЭлементыФормы.КоманднаяПанель2.Кнопки.РаспределитьРасход.Доступность = истина;
	
	ЭлементыФормы.Карты.Колонки.Получено.ТекстПодвала                    = Карты.Итог("Получено");
	ЭлементыФормы.Карты.Колонки.ПолученоРаспределено.ТекстПодвала        = Карты.Итог("ПолученоРаспределено");
	ЭлементыФормы.ЗаправкиНеРаспределенные.Колонки.Получено.ТекстПодвала = ЗаправкиНеРаспределенные.Итог("Получено");
		
	
КонецПроцедуры


Процедура ПриОткрытии()
	РаспределятьАдаптивно = Истина;
	МаксПоГороду  = 100;
	МинимумВБаке = 3.55;	
	МинимальныйРасходТоплива = 1.1;	
	ИсключатьВыходные=истина;
	ЕстьПодключение=ложь;
	
	//КаталогЗагрузки = "\\192.168.30.111\ObmenLS$\LOG\ZIK\waybill\";
	КаталогЗагрузки = "D:\Denis\";
	
КонецПроцедуры


Процедура КоманднаяПанель2РаспределитьРасход(Кнопка)
	// Вставить содержимое обработчика.
	//ЗаправкиНеРаспределенные.Очистить();
	
	для каждого стр из Карты цикл 
		Если стр.Пометка=Истина тогда
			Если стр.ПутевойЛист.Пустая() тогда
				Продолжить;
			конецЕсли;	
			Есть=ложь;
			ПЛ = стр.ПутевойЛист;
			
			ВыполнитьРаспределениеРасхода(ПЛ,стр);
			
		КонецЕсли;
	КонецЦикла;
	
	для каждого стр из Карты цикл
		стр.ПолученоРаспределено= стр.ПутевойЛист.ВыполнениеЗадания.Итог("Получено");
	конецЦикла;

	ЭлементыФормы.Карты.Колонки.Получено.ТекстПодвала = Карты.Итог("Получено");
	ЭлементыФормы.Карты.Колонки.ПолученоРаспределено.ТекстПодвала = Карты.Итог("ПолученоРаспределено");
	ЭлементыФормы.ЗаправкиНеРаспределенные.Колонки.Получено.ТекстПодвала = ЗаправкиНеРаспределенные.Итог("Получено");
	
	Сообщить("Расход топлива распределен! "+Строка(ТекущаяДата()));	
	//ЭлементыФормы.КоманднаяПанель2.Кнопки.РаспределитьРасход.Доступность = Ложь;
КонецПроцедуры

Процедура ВыполнитьРаспределениеРасхода(Путевой,СтрокаКарт)
	Если Путевой.Автомобиль.пустая() тогда
		Сообщить("В путевом: "+ Строка(Путевой)+" - не заполнен автомобиль! распределение не выполнено.",СтатусСообщения.ОченьВажное) ;
		Возврат;
	КонецЕсли; 
	Реж=1; // 2 с указанием расхода топлива в день Израсходовать=5
	// ОстатокТоплива1 - остаток топлива на конец
	// ОстатокТоплива - остаток топлива на НАЧАЛО
	Израсходовать=5;
	Навесь = 1;
	Основа = Путевой.ВыполнениеЗадания.Выгрузить();//  ВЫПИСКА АЗС
	
	РасходГород = 0; //09112022 Банифатов обнуляем расход 
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗОсн= Новый ТаблицаЗначений;
	//Килом= Новый Справочник.Километраж;
	//Если Выписка.Выбран()=0 Тогда
	//	Предупреждение("Необходимо задать выписку!");
	//	Возврат;
	//КонецЕсли;	
	//Если Основа.НайтиДокумент(Выписка)=0 Тогда
	//	Предупреждение("Не найдена выписка!");
	//	Возврат;
	//КонецЕсли;
	Зима=0;
	КМНеБолее=МаксПоГороду; 
	ВБакеНеМенее=МинимумВБаке;    
	ТратитьНеМенее=МинимальныйРасходТоплива;    
	Если Зима=0 Тогда
		РасхПоГор=?(Путевой.РасходТоплива=0, Путевой.Автомобиль.Автомобиль.РасходТоплива,Путевой.РасходТоплива);
	Иначе	
		РасхПоГор=?(Путевой.РасходТоплива=0, Путевой.Автомобиль.Автомобиль.РасходТоплива,Путевой.РасходТоплива);		                                  
	КонецЕсли;	  
	
	РазмерБака = Путевой.Автомобиль.Автомобиль.РазмерБака ;
	Бак=?(РазмерБака=0,55,РазмерБака);//Основа.Автомобиль.Бак;
	
	Если РасхПоГор=0 ТОгда 
		Предупреждение("Необходимо задать расход топлива в справочнике автомобилей...");
	Конецесли;	
	ВсегоЗапр=Основа.Итог("Получено");
	//ОстатокТоплива=?(Путевой.ОстатокТопливаНаНачало=0,рандом(4),Путевой.ОстатокТопливаНаНачало);
	//Если ОстатокТоплива<=0 тогда
	//	ОстатокТоплива = Макс(рандом(4),МинимальныйРасходТоплива+рандом(1));	
	//КонецЕсли;
	ОстатокТоплива = Путевой.ОстатокТопливаНаНачало;
	
		
	ТЗОсн = Основа.Скопировать();//Основа.ВыгрузитьТабличнуюЧасть(ТЗОсн);
	ТЗ.Колонки.Добавить("Дата",ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТЗ.Колонки.Добавить("ВидДня", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДнейПроизводственногоКалендаря"));
	ТЗ.Колонки.Добавить("ОстатокТоплива",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,2));
	ТЗ.Колонки.Добавить("Получено",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,2));
	ТЗ.Колонки.Добавить("РасходГород",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,2));	
	ТЗ.Колонки.Добавить("ОстатокТоплива1",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,2));
	ТЗ.Колонки.Добавить("Время",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,2));
	
	КолЗаправок=0;
	РаспНа=0;//ТЗ.Количество();
	
	Если Навесь=1 Тогда
		НачДТ=НачалоМесяца(Путевой.Дата);
		Пока НачДТ<= КонецМесяца(Путевой.Дата) Цикл
			СтрТЗ = ТЗ.Добавить();//НоваяСтрока();
			СтрТЗ.Дата=НачДТ;     
			
			///	СтрТЗ="";
			СТРТЗОСН =	ТЗОсн.Найти(НачДТ,"Дата");
			
			Если СТРТЗОСН<>Неопределено Тогда
				СтрТЗ.ВидДня  =  СТРТЗОСН.ВидДня;
				СтрТЗ.Получено=СТРТЗОСН.Получено;
				
				Если ИсключатьВыходные  тогда
					
					//СледДень = ТЗОсн[Мин(ТЗОсн.индекс(СТРТЗОСН)+1,ТЗОсн.количество()-1)];
					
					Если  СтрТЗ.ВидДня =  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий  тогда
						//или СледДень.ВидДня =  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И  стрТЗЗ.Время>22 ТОГДА
						
						
						РаспНа=РаспНа+1;
					конецЕсли;
				иначе
					РаспНа=РаспНа+1;
				КонецЕсли;
				
				
				ОтборЗ = Новый Структура("Дата,НомерЭК",НачДТ,СтрокаКарт.НомерЭК);
				СТРЗапр =	Заправки.НайтиСтроки(ОтборЗ);
				Если СТРЗапр.Количество()=0 тогда
					СтрТЗ.Время=22	
				иначе
					СтрТЗ.Время=СТРЗапр[0].Время;//СТРТЗОСН.ДАТА;  
				КонецЕсли;
				Если СтрТЗ.Получено<>0 Тогда
					КолЗаправок=КолЗаправок+1;
				КонецЕсли;	
			КонецЕсли;	
			НачДТ=КонецДня(НачДТ) + 1;
		КонецЦикла;	 
	Иначе   
		//ОСНОВА это ВЫПИСКА  АЗС
		Выписка = тз.СкопироватьКолонки();
		для каждого стрОсн из Основа цикл
			Если стрОсн.получено<>0 Тогда
				стрВ=	Выписка.Добавить();
				ЗаполнитьЗначенияСвойств(стрв,стросн);
			КонецЕсли;
		КонецЦикла;	
		
		Если Выписка.Количество()=0 Тогда Возврат; КонецЕсли;
		стВыписка = Выписка[0];
		НачДТ=стВыписка.Дата;
		//Выписка.ПолучитьСтрокуПоНомеру(Выписка.Количество());
		КонДТ=Выписка[Выписка.Количество()-1].Дата;//Выписка.Дата;
		Пока НачДТ<= КонДТ Цикл
			ТЗ.НоваяСтрока();
			ТЗ.Дата=НачДТ;
			СтрТЗ="";
			Если ТЗОсн.НайтиЗначение(НачДТ,СтрТЗ,"Дата")=1 Тогда
				ТЗ.Получено=ТЗОсн.ПолучитьЗначение(СтрТЗ,"Количество");
				ТЗ.ВидДня  =  ТЗОсн.ПолучитьЗначение(СтрТЗ,"ВидДня");
				ТЗ.Время=ТЗОсн.ПолучитьЗначение(СтрТЗ,"Время");    
				Если ТЗ.Получено<>0 Тогда
					КолЗаправок=КолЗаправок+1;
				КонецЕсли;	
			КонецЕсли;	
			//НачДТ=НачДТ+1;
			НачДТ=КонецДня(НачДТ) + 1;
			
		КонецЦикла;	 
	КонецЕсли;	
	Если ИсключатьВыходные=истина Тогда
		//Если Выходные.Выбран()=1 Тогда
		//	ТЗВых= Новый ТаблицаЗначений;
		//	Выходные.ВыгрузитьТабличнуюЧасть(ТЗВых,"Выходной");
		//	ТЗ.ВыбратьСтроки();
		//	Пока ТЗ.ПолучитьСтроку()=1 Цикл
		//		Если ТЗ.Получено=0 Тогда                      
		//			СтрТЗ="";
		//			Если (ТЗВых.НайтиЗначение(ТЗ.Дата,СтрТЗ,"Выходной")=1) Тогда
		//				ТЗ.УдалитьСтроку();
		//				ТЗ.ВыбратьСтроки();
		//			КонецЕсли;	    
		//		КонецЕсли;	
		//	КонецЦикла;			
		//Иначе
		//ТЗ.ВыбратьСтроки();
		//Пока ТЗ.ПолучитьСтроку()=1 Цикл
		//	для каждого стрТЗЗ из ТЗ цикл
		////К=0;
		////Пока К <= тз.Количество()-1	Цикл
		////	//	для к=0 по КолТЗ цикл
		////	стрТЗЗ = тз[к];
		////	
		////	Если стрТЗЗ.Получено=0 Тогда
		////		
		////		Если (ДеньНедели(стрТЗЗ.Дата)=6)или(ДеньНедели(стрТЗЗ.Дата)=7) Тогда
		////			//ТЗ.Удалить(стрТЗЗ);
		////			//к=К-1;
		////		КонецЕсли;	    
		////	КонецЕсли;
		////	К=К+1;
		////КонецЦикла;
		//КонецЕсли;
	КонецЕсли;
	
	Если РаспНа=0 Тогда
		Сообщить("Документ"+Путевой+" ! не распределен, в распределении 0 литров",СтатусСообщения.Внимание);     	
		Возврат;
	КонецЕсли;  
	Заправят=ТЗ.Итог("Получено");
	Если Реж=1 ТОгда
		ОстИстр=ОстатокТоплива+ВсегоЗапр;
		СрВДень=(ОстИстр/РаспНа+РасхПоГор*КМНеБолее/100)/2;
	ИначеЕсли Реж=2 ТОгда
		ОстИстр=Израсходовать;
		СрВДень=ОстИстр/РаспНа;
	КонецЕсли;
	К=0;
	МаксПробегВДень = 8*60;
	//формула пробега  П = 100 * РасходГород / РасхПоГор
	стрТЗЗ = тз[0];
	Если  стрТЗЗ.ОстатокТоплива <= 0 тогда
		стрТЗЗ.ОстатокТоплива	= ОстатокТоплива;
	Иначе
		ОстатокТоплива=  стрТЗЗ.ОстатокТоплива;
	КонецЕсли;
	
	ЭтоДоставщик =	СтрокаКарт.Водитель.СтатусКатегория = справочники.КатегорииЗастрахованныхЛиц.НайтиПоНаименованию("Доставка");
	ПоследнийРабочийДень= 0;
	Пока К <= тз.Количество()-1	Цикл
		//для каждого стрТЗЗ из ТЗ цикл
		Если ОстатокТоплива<0 Тогда
			стрТЗЗ.РасходГород= (стрТЗЗ.ОстатокТоплива*0.533);	
			стрТЗЗ.ОстатокТоплива1=стрТЗЗ.ОстатокТоплива - стрТЗЗ.РасходГород;
			ОстатокТоплива = стрТЗЗ.ОстатокТоплива1;
		конецЕсли;
		
		стрТЗЗ = тз[к];
		
		Если СтрокаКарт.ДатаУвольнения <> Дата(1,1,1) и СтрокаКарт.ДатаУвольнения < стрТЗЗ.Дата тогда
			  ОстатокТоплива=0;
              тз[ПоследнийРабочийДень].ОстатокТоплива1 = 0;
			  тз[ПоследнийРабочийДень].РасходГород = тз[ПоследнийРабочийДень].ОстатокТоплива ;
			  прервать;
		КонецЕсли;	  
		
		
		//ТЗ.ПолучитьСтрокуПоНомеру(К);
		стрТЗЗ.ОстатокТоплива=ОстатокТоплива;
		// раскомаентить если надо чтобы исключало по дням  выходным
		Если ИсключатьВыходныеЗаправки тогда
			Если  стрТЗЗ.ВидДня <>  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий тогда
				
				СледДень = тз[Мин(к+1,тз.количество()-1)];
				еСЛИ СледДень.ВидДня =  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И  стрТЗЗ.Время>22 ТОГДА
					/// Заправился в выходной вечером- следующий день рабочий;	
				иначе	
					//	Если (ДеньНедели(стрТЗЗ.Дата)=6)или(ДеньНедели(стрТЗЗ.Дата)=7) Тогда
					//ТЗ.Удалить(стрТЗЗ);
					
					стрТЗЗ.ОстатокТоплива1=ОстатокТоплива;
					
					Если стрТЗЗ.получено <>0 и 	ЭтоДоставщик Тогда
						Состояние(строка(стрТЗЗ.Дата) + " - нарушение УК РБ ст. № "+ Строка(Путевой) );
						стрЗР =	ЗаправкиНеРаспределенные.Добавить();
						стрЗР.Автомобиль = Путевой.Автомобиль.Автомобиль;
						стрЗР.Водитель = Путевой.Водитель;
						стрЗР.Дата = стрТЗЗ.Дата;
						стрЗР.ГСМ = СтрокаКарт.ПутевойЛист.ГСМ;
						стрЗР.НомерЭК = СтрокаКарт.НомерЭК;
						стрЗР.Период=   СтрокаКарт.Период   ;
						стрЗР.Получено = стрТЗЗ.Получено; 
						НайтиПодходящиеПутевыеДляНераспределенных(стрЗР)    ;
						
						стрТЗЗ.получено =0;
						
					КонецЕсли;
					
				КонецЕсли;	
				к=К+1;
				РасходГород=0;
				ОстатокТоплива=ОстатокТоплива+стрТЗЗ.Получено-РасходГород  ;
				стрТЗЗ.ОстатокТоплива1 = ОстатокТоплива;
				Продолжить;
			иначе
				ПоследнийРабочийДень= к;
			КонецЕсли;	 
		иначе
			ПоследнийРабочийДень= к;
		КонецЕсли;	
		// раскомаентить если надо чтобы исключало по дням  выходным

		Ранд=Рандом(2);
		Если Реж=1 Тогда
			Если СрВДень>РасхПоГор*КМНеБолее/100 Тогда
				//СрВДень=Окр(РасхПоГор*КМНеБолее/100-Ранд*3,2);
				Если ДоСледующейЗаправки(ТЗ,К)>2 Тогда
					//	СрВДень=Окр((ОстатокТоплива/КолЗаправок+Заправят/Макс(РаспНа,1)+СледЗаправка(ТЗ,К)/ДоСледующейЗаправки(ТЗ,К))/2,2);
					//Иначе	
					//	СрВДень=Окр((ОстатокТоплива/КолЗаправок+Заправят/Макс(РаспНа,1)+РасхПоГор*КМНеБолее/100)/2,2);
					//КонецЕсли;
					СрВДень =	Окр((ОстатокТоплива/Макс(РаспНа,1)*Макс(КолЗаправок,1)+Заправят/Макс(РаспНа,1)+ТЗ.Итог("РасходГород")/(к+1))/2,2);
					//СрВДень=Окр((ОстатокТоплива/КолЗаправок+Заправят/РаспНа+СледЗаправка(ТЗ,К)/ДоСледующейЗаправки)/2,2);
				Иначе	
					СрВДень=Окр((ОстатокТоплива/Макс(КолЗаправок,1)+Заправят/Макс(РаспНа,1)+РасхПоГор*КМНеБолее/100)/1.5,2);
				КонецЕсли;
				
				
				Ранд=Рандом(3);
			КонецЕсли;	
		КонецЕсли;	
		РасходГород=СрВДень;                      
		
		Запр=стрТЗЗ.Получено;
		Если (ОстатокТоплива+Запр-(РасходГород-Ранд)>0)и(ОстатокТоплива+Запр-(РасходГород-Ранд)<5) Тогда
			//Если (стрТЗЗ.Время<18) Тогда
			ДоСледЗапр = Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1);
			
			РасходГород=Окр(РасходГород-Рандом(0.2),2);
			//Иначе
			//	РасходГород=0;
			//КонецЕсли;	
			Если ОстатокТоплива+Запр-РасходГород<МинимумВБаке тогда
				РасходГород=Окр(ОстатокТоплива+Запр-МинимумВБаке+Рандом(2),2);
				//Если РасходГород<МинимальныйРасходТоплива Тогда РасходГород=0; КонецЕсли;
				Если РасходГород<0 Тогда РасходГород=0; КонецЕсли;
				
			КонецЕсли;	
			
			
			Если (ОстатокТоплива/ДоСледЗапр)*2 < РасходГород Тогда
				РасходГород = Окр(Мин((ОстатокТоплива/(ДоСледЗапр+2))+рандом(ОстатокТоплива/(ДоСледЗапр+2),ОстатокТоплива),Рандом(ОстатокТоплива/(ДоСледЗапр+3)+1,ОстатокТоплива)),2);
			КОнецЕсли;	
			
			Если ОстатокТоплива+Запр-РасходГород < 0 Тогда
				РасходГород	 = окр(РасходГород*((ОстатокТоплива+Запр)/РасходГород*100-15)/100,2) ;
			КонецЕсли;
			РасходГород = окр(Макс(РасходГород,Рандом(МинимальныйРасходТоплива,1+ОстатокТоплива/ДоСледЗапр)),2);
		ИначеЕсли (ОстатокТоплива+Запр-(РасходГород-Ранд)<0) Тогда
			Если (Запр>Ранд) Тогда  
				Если (стрТЗЗ.Время<18) Тогда
					РасходГород=окр(Запр-Ранд,2);
				Иначе
					РасходГород=окр(СрВдень/10+Ранд,2);
				КонецЕсли;	
			Иначе                         
				
				РасходГород=окр(СрВдень/10+Ранд,2); 
			КонецЕсли;	           
			Если ОстатокТоплива+Запр-РасходГород<МинимумВБаке тогда
				РасходГород=окр(ОстатокТоплива+Запр-МинимумВБаке+Ранд,2);
				Если РасходГород<МинимальныйРасходТоплива Тогда РасходГород=Рандом(МинимальныйРасходТоплива); КонецЕсли;
				Если РасходГород<0 Тогда РасходГород=окр(Рандом(МинимальныйРасходТоплива),2); КонецЕсли;
				
			КонецЕсли;	
			
			Если ОстатокТоплива+Запр-РасходГород < 0 Тогда
				РасходГород	 = окр(РасходГород*((ОстатокТоплива+Запр)/РасходГород*100-20)/100,2) ;
			КонецЕсли;
		Иначе
			Если(ОстатокТоплива+Запр-(РасходГород-Ранд)>Бак) Тогда
				//Если (стрТЗЗ.Время<18) Тогда
				//	РасходГород=ОстатокТоплива+Запр-Бак+Ранд;
				//Иначе
				РасходГород=окр((СледЗаправка(ТЗ,К)+Запр)/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/1.2)+Ранд,2);//СрВдень/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/6)+Ранд;
				//				КонецЕсли;	
			Иначе
				//	Если (стрТЗЗ.Время<18) Тогда
				Если ТЗ.количество()-1 =к тогда
					РасходГород=окр(СрВдень/10+Ранд,2);
				ИначеЕсли (СледЗаправка(ТЗ,К)+Запр)>Бак  тогда
					РасходГород = Окр((СледЗаправка(ТЗ,К)+Запр)/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина)*2,1)+2/1.2)+Ранд,2)//СрВдень/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/3)+Ранд//РасходГород-Ранд;
				иначе	
					РасходГород = окр(СрВдень/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/2)+Ранд,2)
				КонецЕсли;	
				//	Иначе
				//		РасходГород=СрВдень/10+Ранд;
				//	КонецЕсли;	
			КонецЕсли;
			Если ОстатокТоплива+Запр-РасходГород<МинимумВБаке тогда
				РасходГород=окр((ОстатокТоплива+Запр-МинимумВБаке+Ранд) /2 ,2);//09112022 Банифатов делим расход на 2 для уменьшения расхода в первый день заправки было //*РасходГород=окр(ОстатокТоплива+Запр-МинимумВБаке+Ранд ,2);//*
				Если РасходГород<МинимальныйРасходТоплива Тогда РасходГород=окр(Рандом(МинимальныйРасходТоплива),2); КонецЕсли;
				Если РасходГород<0 Тогда РасходГород=окр(Рандом(МинимальныйРасходТоплива),2); КонецЕсли;
				
			КонецЕсли;	
			
			Если ОстатокТоплива+Запр-РасходГород < 0 Тогда
				РасходГород	 = окр(РасходГород*((ОстатокТоплива+Запр)/РасходГород*100-20)/100,2) ;
			КонецЕсли;
			
		КонецЕсли;	
		
		
		//МаксПробегВДень = 8*60;
		//формула пробега  П = 100 * РасходГород / РасхПоГор
		Если (100 * РасходГород / РасхПоГор )> МаксПробегВДень тогда
			cc=1;
			РасходГород =  Окр(( МаксПробегВДень*0.7/100*РасхПоГор)+ранд,2);
		КонецЕсли;
		
		Если(ОстатокТоплива+Запр-(РасходГород-Ранд)>Бак) Тогда
			РасходГород=окр((СледЗаправка(ТЗ,К)+Запр)/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/1.2)+Ранд,2);//СрВдень/(Макс(ДоСледующейЗаправки(ТЗ,К,Истина),1)/6)+Ранд;
		КонецЕсли;
		
		
		//09112022Банифатов проверка по минимальному расходу, в конце месяца не трогаем 
		Если РасходГород < МинимальныйРасходТоплива и День(стрТЗЗ.Дата) < 28 Тогда
			РасходГород = 0;
		КонецЕсли;	
		
		
		ОстатокТоплива=ОстатокТоплива+Запр-РасходГород;
		
		Если Запр<>0 Тогда	
			Заправят=Заправят-стрТЗЗ.Получено;
			КолЗаправок=КолЗаправок-1;
		КонецЕсли;	
		
		
		стрТЗЗ.РасходГород=Макс(РасходГород,0);	 
				               
		ОстИстр=ОстИстр-РасходГород;
		Если стрТЗЗ.РасходГород<>0 тогда
			РаспНа=РаспНа-1;  
		КонецЕсли;
		Удал=ЛОжь;
		Если (стрТЗЗ.Получено=0)и(стрТЗЗ.РасходГород=0) Тогда
			//стрТЗЗ.ОстатокТоплива1=ОстатокТоплива; 
			//ТЗ.Удалить(стрТЗЗ);	
			//К=К-1;
			//ОстатокТоплива= ОстатокТоплива+Запр-РасходГород
			Удал=Истина;
			
		КонецЕсли;		
		Если РаспНа<>0 Тогда
			Если Реж=1 ТОгда
				Если КолЗаправок=0 Тогда
					КолЗаправок=1;
				КонецЕсли;
				ДоСледующейЗаправки =  ДоСледующейЗаправки(ТЗ,К);
				Если ДоСледующейЗаправки>2 Тогда
					СрВДень =	Окр((ОстатокТоплива/РаспНа*КолЗаправок+Заправят/РаспНа+ТЗ.Итог("РасходГород")/(к+1))/2,2);
					//СрВДень=Окр((ОстатокТоплива/КолЗаправок+Заправят/РаспНа+СледЗаправка(ТЗ,К)/ДоСледующейЗаправки)/2,2);
				Иначе	
					СрВДень=Окр((ОстатокТоплива/КолЗаправок+Заправят/РаспНа+РасхПоГор*КМНеБолее/100)/1.5,2);
				КонецЕсли;
			ИначеЕсли Реж=2 ТОгда
				СрВДень=ОстИстр/РаспНа;
			КонецЕсли;	
		КонецЕсли;	                   
		К=К+1;
		//	Если	Удал=ложь тогда
		стрТЗЗ.ОстатокТоплива1 =  стрТЗЗ.ОстатокТоплива + стрТЗЗ.Получено - стрТЗЗ.РасходГород ;
		ОстатокТоплива=стрТЗЗ.ОстатокТоплива1;  
		//	КонецЕсли;
		
		//		стрТЗЗ.ОстатокТоплива1=ОстатокТоплива;  
	КонецЦикла;	
	//		стрТЗЗ.ОстатокТоплива1=ОстатокТоплива;   
	
	Если Реж=2 Тогда
		стрТЗЗ = ТЗ[ТЗ.Количество()-1];
		Коррекция=ТЗ.Итог("РасходГород")-Израсходовать;
		стрТЗЗ.РасходГород=стрТЗЗ.РасходГород-Коррекция;
		ОстатокТоплива=стрТЗЗ.ОстатокТоплива+стрТЗЗ.Получено-стрТЗЗ.РасходГород;
		Если ((ОстатокТоплива<0)и(ОстатокТоплива>-0.5)) Тогда
			стрТЗЗ.РасходГород=стрТЗЗ.ОстатокТоплива+стрТЗЗ.Получено;
			ОстатокТоплива=0;
		ИначеЕсли ОстатокТоплива<0 Тогда
			Предупреждение("Невозможно выписать правильную ведомость...");
			Возврат;
		КонецЕсли;
		Если стрТЗЗ.РасходГород<0 Тогда
			Предупреждение("Невозможно выписать правильную ведомость...");
			Возврат;
		КонецЕсли;
		стрТЗЗ.ОстатокТоплива1=ОстатокТоплива;
	КонецЕсли;	
	
	Если ТЗ.Количество() <> 0 тогда
		
		Если РаспределятьАдаптивно Тогда
			ТЗ = РаспределитьТопливо(ТЗ, Бак);
		КонецЕсли;
		
		об =  Путевой.ПолучитьОбъект();
		ТЗпл = об.ВыполнениеЗадания; 
		Есть = ЛОжь;
		Для каждого стрЗ из ТЗ цикл
			
			отборПЛ = Новый Структура("Дата",стрЗ.Дата);
			стрПЛ = ТЗпл.НайтиСтроки(отборПЛ);
			для каждого сПЛ из стрПЛ цикл
				ЗаполнитьЗначенияСвойств(спл,стрЗ);
				спл.РасстояниеТрасса = 0;
				Есть=истина;
			КонецЦикла;
		КонецЦикла;
		Если Есть = Истина тогда
			ПересчетСпидометра(об, Истина, Истина);
			об.Записать();
		КонецЕсли;
	иначе
		Сообщить(". Документ"+Путевой+" ! не распределен");     	
	КонецЕсли;
	
КонецПроцедуры   

Функция Рандом(Парам=1,ОстатокТоплива=10, МаксРасход=3.5)
	
	ТекВремя = ТекущаяДата();
	СлЧисло =(Текущаядата() - началоМесяца(Текущаядата()) )/32;
	СлЧисло = число(Прав(стрЗаменить(Формат(СлЧисло, "ЧГ=10"),",",""),5));
	МинимальныйРасход = МинимальныйРасходТоплива*1000+1933;///2.5*100;	
	МаксимальныйРасход =Макс(ОстатокТоплива,МаксРасход)*1000;	
	ГСЧ = Новый ГенераторСлучайныхЧисел(0);
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(МинимальныйРасход, МаксимальныйРасход) ;
	Случай = СлучайноеЧисло+СлЧисло/35333;
	Случай=(1803*парам*Случай)%2197983647;

	Возврат(Случай/10000000);
КонецФункции   

Функция ДоСледующейЗаправки(ТЗ,К,РабочихДней =ЛОжь)
	КК =К;
	Если ((ТЗ.Количество()-1>КК)
		//и(КК>=1)
		) Тогда
		Н=0;                           
		КК=КК+1;
		Пока КК<=ТЗ.Количество()-1 Цикл
			СтрТЗ =	ТЗ[КК];//.ПолучитьСтрокуПоНомеру(К);
			Если РабочихДней тогда
				Если СтрТЗ.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий тогда
					КК=КК+1;
					Продолжить;
				КонецЕсли;	
			КОнецЕсли;	
			Если СтрТЗ.Получено<>0 Тогда
				Прервать;
			КонецЕсли;
			Н=Н+1;
			КК=КК+1;			
		КонецЦикла;      
		возврат Н;
	КонецЕсли;    
	возврат -1;
КонецФункции   

/////////////////////////////////////////////
Функция СледЗаправка(ТЗ,К)
	КК =К;
	Если ((ТЗ.Количество()-1>КК)и(КК>=1)) Тогда
		КК=КК+1;
		Пока КК<=ТЗ.Количество()-1 Цикл
			СтрТЗ =	ТЗ[КК];//ТЗ.ПолучитьСтрокуПоНомеру(К);
			Если СтрТЗ.Получено<>0 Тогда
				Возврат СтрТЗ.Получено;
			КонецЕсли;
			КК=КК+1;			
		КонецЦикла;      
	КонецЕсли;    
	возврат 0;
КонецФункции                

// Процедуры и функции для постобработики таблицы значений, чтобы равномерно распределить топливо

//Денис 2026 04
Функция РаспределитьТопливо(ТаблицаДней, ЕмкостьБака) Экспорт
	
	Результат = ТаблицаДней.Скопировать();
	Результат.Сортировать("Дата");
	Результат.Колонки.Добавить("РасходТрасса", Новый ОписаниеТипов("Число"));
	
	РаспределятьНаДней = 0;
	ПоследнийРабочийДень = Неопределено;
	
	
	Для Каждого Стр Из Результат Цикл
		
		Стр.РасходГород = 0;
		Стр.ОстатокТоплива = 0;
		Стр.ОстатокТоплива1 = 0;
		
	КонецЦикла;
	
	ПересчетТаблицыТоплива(Результат);
	
	Для Каждого Стр Из Результат Цикл
		Если ИсключатьВыходные И Стр.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.ОстатокТоплива = 0 И Стр.Получено = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РаспределятьНаДней = РаспределятьНаДней + 1;
		ПоследнийРабочийДень = Стр;
	КонецЦикла;
	
	ПолученоСумма = Результат.Итог("Получено");
	
	СрЗнач = ПолученоСумма / РаспределятьНаДней;
	
	ШагУменьшения = Окр(СрЗнач / 20, 2);
	
	ОстНаНачало = Неопределено;
	Для Каждого Стр Из Результат Цикл
		МожноРаспределять = Истина;
		Если ИсключатьВыходные И Стр.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
			МожноРаспределять = Ложь;
		КонецЕсли;
		
		Если Стр.ОстатокТоплива = 0 И Стр.Получено = 0 Тогда
			МожноРаспределять = Ложь;
		КонецЕсли;
		
		Если МожноРаспределять Тогда
			Стр.РасходГород = СрЗнач;
		КонецЕсли;
		
		Если ОстНаНачало <> Неопределено Тогда
			Стр.ОстатокТоплива = ОстНаНачало;
		КонецЕсли;
		Стр.ОстатокТоплива1 = Стр.ОстатокТоплива + Стр.Получено - Стр.РасходГород;
		ОстНаНачало = Стр.ОстатокТоплива1;
	КонецЦикла;
	
	НормализоватьТаблицу(Результат, ЕмкостьБака, ШагУменьшения);
	
	НужноДобавить = ПолученоСумма - Результат.Итог("РасходГород");
	
	Если НужноДобавить > 0 Тогда
		ПоследнийРабочийДень.РасходГород = ПоследнийРабочийДень.РасходГород + НужноДобавить;
	Иначе
		ПоследнийРабочийДень.РасходГород = ПоследнийРабочийДень.РасходГород + НужноДобавить;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НормализоватьТаблицу(Результат, ЕмкостьБака, ШагУменьшения)
	
	МаксимальнаяСтрокаНормализации = Неопределено;
	ОстНаНачало = Неопределено;
	КРаспределению = 0;
	Для Счетчик = 0 По Результат.Количество() - 1 Цикл
		ТекСтр = Результат[Счетчик];
		Если ОстНаНачало <> Неопределено Тогда
			ТекСтр.ОстатокТоплива = ОстНаНачало;
		КонецЕсли;
		ТекСтр.ОстатокТоплива1 = ТекСтр.ОстатокТоплива + ТекСтр.Получено - ТекСтр.РасходГород;
		ОстНаНачало = ТекСтр.ОстатокТоплива1;
		
		Если ТекСтр.РасходГород > 0 Тогда
			
			Если МаксимальнаяСтрокаНормализации = Неопределено Тогда
				МаксимальнаяСтрокаНормализации = ТекСтр;
			Иначе
				Если МаксимальнаяСтрокаНормализации.РасходГород <= ТекСтр.РасходГород Тогда
					МаксимальнаяСтрокаНормализации = ТекСтр;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекСтр.ОстатокТоплива1 < 0 Или ТекСтр.РасходГород > ЕмкостьБака Тогда
				МаксимальнаяСтрокаНормализации.РасходГород = МаксимальнаяСтрокаНормализации.РасходГород - ШагУменьшения;
				Счетчик = -1;
				МаксимальнаяСтрокаНормализации = Неопределено;
				ОстНаНачало = Неопределено;
				ПересчетТаблицыТоплива(Результат);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Дата,
	|	ТЗ.ОстатокТоплива1 КАК ОстатокТоплива1
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.РасходГород = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ.Дата) КАК Дата,
	|	ВТ.ОстатокТоплива1
	|ПОМЕСТИТЬ ВТ_Груп
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ОстатокТоплива1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Груп.Дата,
	|	ВТ_Груп.ОстатокТоплива1
	|ИЗ
	|	ВТ_Груп КАК ВТ_Груп
	|ГДЕ
	|	ВТ_Груп.Дата > &Дата";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Результат[0].Дата));
	Запрос.УстановитьПараметр("ТЗ", Результат);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДат = РезультатЗапроса.Выгрузить();
	ТаблицаДат.Сортировать("Дата");
	
	КРаспределению = Результат.Итог("Получено") - Результат.Итог("РасходГород");
	
	Если КРаспределению > 0 Тогда
		
		ДеньНачалаРаспределения = Неопределено;
		ДеньНачалаРаспределенияНайден = Ложь;
		Счетчик = Результат.Количество() - 1;
		РаспНа = 0;
		Пока Не ДеньНачалаРаспределенияНайден Цикл
			СтрРез = Результат[Счетчик];
			Если СтрРез.ОстатокТоплива1 >= КРаспределению И СтрРез.РасходГород > 0 Тогда
				ДеньНачалаРаспределения = День(СтрРез.Дата) - 1;
				РаспНа = РаспНа + 1;
			ИначеЕсли СтрРез.ОстатокТоплива1 < КРаспределению И СтрРез.РасходГород > 0 Тогда
				ДеньНачалаРаспределенияНайден = Истина;
			КонецЕсли;
			Если Счетчик = 0 Тогда
				ДеньНачалаРаспределения = Результат.Количество() - 1;
				РаспНа = 1;
				Прервать;
			Иначе
				Счетчик = Счетчик - 1;
			КонецЕсли;
		КонецЦикла;
		
		Если ДеньНачалаРаспределения = Неопределено Тогда
			ДеньНачалаРаспределения = 0;
		КонецЕсли;
		
		Для Счетчик = ДеньНачалаРаспределения По Результат.Количество() - 1 Цикл
			
			СтрРез = Результат[Счетчик];
			
			Если РаспНа = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрРез.РасходГород > 0 Тогда
				СреднееКолво = КРаспределению / РаспНа;
				СтрРез.РасходГород = СтрРез.РасходГород + СреднееКолво;
				РаспНа = РаспНа - 1;
				КРаспределению = КРаспределению - СреднееКолво;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Добавление случайности
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Для Каждого СтрДат Из ТаблицаДат Цикл
		
		СчетчикДат = День(СтрДат.Дата) - 2;
		РаспределениеЗакончено = Ложь;
		Пока Не РаспределениеЗакончено Цикл
			
			Если СчетчикДат <= 0 Тогда
				РаспределениеЗакончено = Истина;
				Продолжить;
			КонецЕсли;
			
			Стр1 = Результат[СчетчикДат];
			Стр2 = Результат[СчетчикДат - 1];
			
			Если Стр1.РасходГород = 0 Или Стр2.РасходГород = 0 Тогда
				РаспределениеЗакончено = Истина;
			Иначе
				РандомЧ = ГСЧ.СлучайноеЧисло(1, 5) / 10 * ШагУменьшения;
				Стр1.РасходГород = Стр1.РасходГород + РандомЧ;
				Стр2.РасходГород = Стр2.РасходГород - РандомЧ;
				СчетчикДат = СчетчикДат - 2;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПересчетТаблицыТоплива(Результат);
	
КонецПроцедуры

Процедура ПересчетТаблицыТоплива(ТЗ)
	
	ОстНаНачало = Неопределено;
	Для Счетчик = 0 По ТЗ.Количество() - 1 Цикл
		ТекСтр = ТЗ[Счетчик];
		Если ОстНаНачало <> Неопределено Тогда
			ТекСтр.ОстатокТоплива = ОстНаНачало;
		КонецЕсли;
		ТекСтр.ОстатокТоплива1 = ТекСтр.ОстатокТоплива + ТекСтр.Получено - ТекСтр.РасходГород;
		ОстНаНачало = ТекСтр.ОстатокТоплива1;
	КонецЦикла;
	
КонецПроцедуры


// Конец постобработка ТЗ

Процедура НайтиПодходящиеПутевыеДляНераспределенных(СтрНерас = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПутевойЛистВыполнениеЗадания.Ссылка,
	|	ПутевойЛистВыполнениеЗадания.Дата,
	|	ПутевойЛистВыполнениеЗадания.ВидДня,
	|	ПутевойЛистВыполнениеЗадания.ОстатокТоплива,
	|	ПутевойЛистВыполнениеЗадания.ОстатокТоплива1,
	|	ПутевойЛистВыполнениеЗадания.Получено,
	|	ПутевойЛистВыполнениеЗадания.Ссылка.Автомобиль.Автомобиль.НомерЭК,
	|	ПутевойЛистВыполнениеЗадания.Ссылка.ГСМ
	|ПОМЕСТИТЬ ПОДХОДИТ
	|ИЗ
	|	Документ.ПутевойЛист.ВыполнениеЗадания КАК ПутевойЛистВыполнениеЗадания
	|ГДЕ
	|	ПутевойЛистВыполнениеЗадания.Ссылка В(&МассивПутевых)
	|	И ПутевойЛистВыполнениеЗадания.Получено < 6
	|	И ПутевойЛистВыполнениеЗадания.ВидДня = &ВидДняРабочий
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Водитель <> &Водитель
	|	И ПутевойЛистВыполнениеЗадания.Дата = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Организация = &Организация
	|	И ПутевойЛистВыполнениеЗадания.ОстатокТоплива1 < &РазмерБака / 3
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.ГСМ = &ГСМ
	|	И ПутевойЛистВыполнениеЗадания.Водитель.СтатусКатегория = &ЭтоДоставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПутевойЛистВыполнениеЗадания.Ссылка,
	|	ПутевойЛистВыполнениеЗадания.Дата,
	|	ПутевойЛистВыполнениеЗадания.ВидДня,
	|	ПутевойЛистВыполнениеЗадания.ОстатокТоплива,
	|	ПутевойЛистВыполнениеЗадания.ОстатокТоплива1,
	|	ПутевойЛистВыполнениеЗадания.Получено,
	|	ПутевойЛистВыполнениеЗадания.Ссылка.Автомобиль.Автомобиль.НомерЭК,
	|	ПутевойЛистВыполнениеЗадания.Ссылка.ГСМ,
	|	ПутевойЛист.ВсегоПолучено КАК ВсегоПолучено,
	|	ПутевойЛист.РабочихДней,
	|	ПутевойЛист.ВсегоПолучено / ПутевойЛист.РабочихДней КАК коэф
	|ИЗ
	|	Документ.ПутевойЛист.ВыполнениеЗадания КАК ПутевойЛистВыполнениеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПутевойЛист.Получено) КАК ВсегоПолучено,
	|			ПутевойЛист.Ссылка КАК Ссылка,
	|			СУММА(ВЫБОР
	|					КОГДА ПутевойЛист.ВидДня = &ВидДняРабочий
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК РабочихДней
	|		ИЗ
	|			Документ.ПутевойЛист.ВыполнениеЗадания КАК ПутевойЛист
	|		ГДЕ
	|			ПутевойЛист.Ссылка В(&МассивПутевых)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПутевойЛист.Ссылка) КАК ПутевойЛист
	|		ПО ПутевойЛистВыполнениеЗадания.Ссылка = ПутевойЛист.Ссылка
	|ГДЕ
	|	ПутевойЛистВыполнениеЗадания.Ссылка В(&МассивПутевых)
	|	И ПутевойЛистВыполнениеЗадания.Получено < 6
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Водитель <> &Водитель
	|	И ПутевойЛистВыполнениеЗадания.Дата = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, 1), ДЕНЬ)
	|	И ПутевойЛистВыполнениеЗадания.ВидДня = &ВидДняРабочий
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ПутевойЛистВыполнениеЗадания.Ссылка.Организация = &Организация
	|	И ПутевойЛистВыполнениеЗадания.ОстатокТоплива1 < &РазмерБака / 3
	|	И ПутевойЛистВыполнениеЗадания.Ссылка В
	|			(ВЫБРАТЬ
	|				ПОДХОДИТ.Ссылка
	|			ИЗ
	|				ПОДХОДИТ КАК ПОДХОДИТ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	коэф";
	
	Запрос.УстановитьПараметр("ВидДняРабочий", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("Водитель", СтрНерас.Водитель);
	Запрос.УстановитьПараметр("ГСМ", СтрНерас.ГСМ);
	Запрос.УстановитьПараметр("Дата", СтрНерас.Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивПутевых", Карты.ВыгрузитьКолонку("ПутевойЛист"));
	
	ЭтоДоставщик =	справочники.КатегорииЗастрахованныхЛиц.НайтиПоНаименованию("Доставка");
	Запрос.УстановитьПараметр("ЭтоДоставщик",ЭтоДоставщик);

	РазмерБака =55;
	Запрос.УстановитьПараметр("РазмерБака", РазмерБака);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи  
		//если 	СтрНерас.Дата = ВыборкаДетальныеЗаписи.Дата  тогда
			ОтборСтр = Новый Структура("Дата,ПутевойКудаРаспределить",СтрНерас.Дата,ВыборкаДетальныеЗаписи.Ссылка);
			
			СтрокиР = ЗаправкиНеРаспределенные.НайтиСтроки(ОтборСтр);
			Если СтрокиР.Количество()=0 тогда
				СтрНерас.ПутевойКудаРаспределить =	ВыборкаДетальныеЗаписи.Ссылка;
				прервать;
			КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
Процедура НайтиПодходящиеНажатие(Элемент)
	
	СтрНерас =	ЭлементыФормы.ЗаправкиНеРаспределенные.ТекущиеДанные;
	НайтиПодходящиеПутевыеДляНераспределенных(СтрНерас)    ;
	
КонецПроцедуры


Процедура КартыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если  ЗначениеЗаполнено(ДанныеСтроки.ПутевойЛист) и ЗначениеЗаполнено(ДанныеСтроки.ГСМ) и ДанныеСтроки.ГСМ<>ДанныеСтроки.ПутевойЛист.ГСМ тогда
		ОформлениеСтроки.цветФона = WebЦвета.БледноКрасноФиолетовый;
	КонецЕсли;	   
	Если   ЗначениеЗаполнено(ДанныеСтроки.Водитель) тогда 
		ДанныеСтроки.СтатусКатегория  =   ДанныеСтроки.Водитель.СтатусКатегория;
	КонецЕсли;	
КонецПроцедуры

Функция НайтиАвтомобильОСпоВодителю(Водитель)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Ссылка
	|ПОМЕСТИТЬ ВТАвто
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	Автомобили.Водитель = &Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Автомобиль В
	|			(ВЫБРАТЬ
	|				ВТАвто.Ссылка
	|			ИЗ
	|				ВТАвто КАК ВТАвто)";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат   ВыборкаДетальныеЗаписи.Ссылка ;
	КонецЕсли;;
	возврат Неопределено;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецФункции	

Функция НайтиАвтомобильОСпоАвтомобилю(Автомобиль)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка ;
		
	КонецЕсли;;
	
	Возврат Неопределено;
	
КонецФункции	



Процедура КоманднаяПанель2СоздатьПутевой(Кнопка)
	// Вставить содержимое обработчика.
	ТекД = ЭлементыФормы.карты.ТекущиеДанные;
	если не ЗначениеЗаполнено(ТекД.ПутевойЛист) тогда 
		СсылкаНаДокумент   = 	  СоздатьПутевой(ТекД);
		ТекД.ПутевойЛист = СсылкаНаДокумент;
	КонецЕсли;
	Если не ТекД.ПутевойЛист.Пустая() тогда
		ЗаполнитьДокументуПоТабелю(ТекД);
		СсылкаНаДокумент =ТекД.ПутевойЛист;
	КонецЕсли;	 
	ОткрытьЗначение(СсылкаНаДокумент);
КонецПроцедуры

Функция СоздатьПутевой(ТекСрока = Неопределено)
	Если  ТекСрока <> Неопределено тогда
		НовыйДокумент = Документы.ПутевойЛист.СоздатьДокумент();
		//	НовыйДокумент.Номер = "111";
		НовыйДокумент.Организация        = Организация;
		НовыйДокумент.НомерПутевого      = Формат(ТекСрока.Период, "ДФ=MM")+"/"+СокрЛП(ТекСрока.Водитель.Код);
		НовыйДокумент.Комментарий        = СокрЛП(ТекСрока.НомерЭК);
		НовыйДокумент.Дата               = КонецМесяца(ТекСрока.Период);
		//НовыйДокумент.Автомобиль = НайтиАвтомобильОСпоВодителю(ТекСрока.Водитель);
		//За одним водителем может быть несколько автомобилей будем искать по ТК и ОС
		
		НовыйДокумент.Автомобиль          = НайтиАвтомобильОСпоАвтомобилю(ТекСрока.Автомобиль); 
		НовыйДокумент.Марка               = ТекСрока.Автомобиль;
		НовыйДокумент.ГосНомер            = ТекСрока.Автомобиль.ГосНомер;
		НовыйДокумент.РасходТоплива       = ТекСрока.Автомобиль.РасходТоплива;
		НовыйДокумент.РасходТопливаТрасса = ТекСрока.Автомобиль.РасходТопливаТрасса;
		
		НовыйДокумент.ДатаНачала         = НачалоМесяца(ТекСрока.Период);
		НовыйДокумент.ДатаОкончания      = КонецМесяца(ТекСрока.Период);
		
		НовыйДокумент.ТабНомер           = ТекСрока.Водитель.Код;
		НовыйДокумент.Водитель           = ТекСрока.Водитель;
		НовыйДокумент.ГСМ                = ТекСрока.Автомобиль.ГСМ; 
		НовыйДокумент.НачальныйСпидометр = ПолучитьОстатокТоплева(Истина,НовыйДокумент);
		НовыйДокумент.Ответственный      = глЗначениеПеременной("глТекущийПользователь");

		НовыйДокумент.Записать();
		
		Возврат НовыйДокумент.Ссылка;
	конецЕсли;
	
	
	
КонецФункции

Процедура ПодключитьБазу() 
	
	База="";
	База=Новый COMОбъект("V77.Application");
   ПутьКБазе = "\\1c7app\1czp$\Novita Zar" ;
//	ПутьКБазе = "\\192.168.30.106\D$\Program\Novita Zar\" ;
	
	бПользователь = "Администратор";     
	Пароль = "235678" ;
	Попытка   
		СтрокаПодключения = "/D"""+СокрЛП(ПутьКБазе)+""" /N"""+СокрЛП(бПользователь)+""" /P"""+СокрЛП(Пароль)+"""";
		Открыта=База.Initialize(База.RMTrade,СтрокаПодключения,"NO_SPLASH_SHOW");
		
		Если Открыта Тогда
			ЕстьПодключение = Истина;
		Иначе
			Сообщить("Ошибка при подключении!");
			ЕстьПодключение = Ложь;
		КонецЕсли;	
	Исключение
		Сообщить("Ошибка при подключении!");
		ЕстьПодключение = Ложь;
	КонецПопытки;
	
	//УправлениеДоступностью();
	
КонецПроцедуры

Процедура v77_РазорватьСвязь (BaseOLE) Экспорт
	Попытка
		BaseOLE.ExecuteBatch("ЗавершитьРаботуСистемы(0)");
	Исключение
		//Сообщить("Ошибка закрытия процесса 1с 7.7")
	КонецПопытки;
	
	BaseOLE = 0;    
КонецПроцедуры

Функция Подключить1с8ЗУП()
	Бух = Новый COMОбъект("V83.COMConnector.1"); 

	Попытка 
		в8 = Бух.Connect("Srvr="""+СокрЛП(Адрес)+""";Ref="""+СокрЛП(БазаД)+""";Usr="""+СокрЛП(Пользователь)+""";Pwd="""+СокрЛП(Пароль)+""";"); 
		Сообщить("Подключение к 1С8 ЗУП прошло успешно!"); 
		Возврат Истина
	Исключение 
		Сообщить("Ошибка при подключении к 1С8 ЗУП!"+ОписаниеОшибки()); 
		Возврат ложь ; 
	КонецПопытки;	
КонецФункции
Функция ПолучитьТабельСотрудника1с8ЗУП(Сотрудники,ДатаНачала,ДатаОкончания)
	
	если Не ЕстьПодключение тогда
		ЕстьПодключение=Подключить1с8ЗУП();
	КонецЕсли;
	если Не ЕстьПодключение тогда
		Возврат ложь;
	КонецЕсли;
	
	
	//НСтроки = Сотрудники.НайтиСтроки(Новый Структура("Выгружать",Истина));
	Если не Сотрудники.Количество() Тогда
		Возврат ложь;
	КонецЕсли;
	
	К100 = в8.NewObject("КвалификаторыСтроки",100,в8.ДопустимаяДлина.Переменная);
	ОписаниеСтрока100 = в8.NewObject("ОписаниеТипов","Строка",К100);
	К10 = в8.NewObject("КвалификаторыСтроки",20,в8.ДопустимаяДлина.Переменная);
	ОписаниеСтрока10 = в8.NewObject("ОписаниеТипов","Строка",К10);
	ТЗКом = в8.NewObject("ТаблицаЗначений");
	ТЗКом.Колонки.Добавить("Наименование",ОписаниеСтрока100);
	ТЗКом.Колонки.Добавить("КодСотрудника",ОписаниеСтрока10);
	
	Для Каждого стр из Сотрудники Цикл
	//	Если стр.Выгружать Тогда
			нс = ТЗКом.Добавить();
			ЗаполнитьЗначенияСвойств(нс,стр);
	//	КонецЕсли;
	КонецЦикла;
	
	// Новый табель
	Запрос = в8.NewObject("Запрос");
	МенеджерВТ = в8.NewObject("МенеджерВременныхТаблиц");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|ТЗ.Наименование КАК Наименование,
	|ТЗ.КодСотрудника КАК КодСотрудника
	|ПОМЕСТИТЬ ВТДанныеСотрудников
	|ИЗ
	|&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|&ДатаНачала КАК ДатаНачала,
	|&ДатаОкончания КАК ДатаОкончания,
	|Сотрудники.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|(Сотрудники.Наименование) В
	|(ВЫБРАТЬ
	|ВТДанныеСотрудников.Наименование
	|ИЗ
	|ВТДанныеСотрудников)";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗКом);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	Запрос.Выполнить();
	
	ПараметрыПолученияДанных = в8.УчетРабочегоВремени.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
	ПараметрыПолученияДанных.ДатаНачала = ДатаНачала;
	ПараметрыПолученияДанных.ДатаОкончания = КонецДня(ДатаОкончания);
	ПараметрыПолученияДанных.МесяцДатаНачала = ДатаНачала;
	ПараметрыПолученияДанных.МесяцДатаОкончания = КонецДня(ДатаОкончания);
	ПараметрыПолученияДанных.ДатаАктуальности = ТекущаяДата();
	в8.УчетРабочегоВремени.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияДанных);
	ДанныеТабеляТ13 = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВТДанныеУчетаВремениИСостоянийСотрудников").ПолучитьДанные().Выгрузить();
	
	а = 0;
	
	Запрос = в8.NewObject("Запрос");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТЗ", ДанныеТабеляТ13);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ДатаОкончания));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|ТЗ.Сотрудник,
	|ТЗ.Дата,
	|ТЗ.Организация,
	|ТЗ.Часы
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ &ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ВТРезультат.Сотрудник КАК Сотрудник,
	|ВТРезультат.Сотрудник.Наименование КАК Наименование,
	|ВТРезультат.Сотрудник.Код КАК КодСотрудника,
	|ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|ВТРезультат.Дата КАК Период,
	|ВТРезультат.Организация.ИНН КАК ОрганизацияИНН,
	|ВТРезультат.Часы
	|ИЗ
	|ВТРезультат
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ОкончаниеПериода, ) КАК ФИОФизическихЛицСрезПоследних
	|ПО Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИТОГИ ПО
	|	ОрганизацияИНН,
	|	Сотрудник";
	
	//Результат = Запрос.Выполнить();
	//// Конец новый табель
	//
	//
	//Свойство = в8.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Выгружать в путевые листы (БУ)");
	//
	//Запрос = в8.NewObject("Запрос");
	//Запрос.УстановитьПараметр("Свойство",Свойство);
	//Запрос.УстановитьПараметр("ТЗ",ТЗКом);
	//Запрос.УстановитьПараметр("ИНН",Организация.ИНН);
	//Запрос.УстановитьПараметр("НачалоПериода",ДатаНачала);
	//Запрос.УстановитьПараметр("ОкончаниеПериода",КонецДня(ДатаОкончания));
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТЗ.Наименование КАК Наименование,
	//|	ТЗ.КодСотрудника КАК КодСотрудника
	//|ПОМЕСТИТЬ ВТДанныеСотрудников
	//|ИЗ
	//|	&ТЗ КАК ТЗ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Сотрудники.Ссылка КАК Сотрудник,
	//|	Сотрудники.Наименование КАК Наименование,
	//|	Сотрудники.Код КАК КодСотрудника,
	//|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	//|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	//|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	//|	ЕСТЬNULL(РабочееВремяДляУправления.Период, РабочееВремяСотрудников.Период) КАК Период,
	//|	Организации.ИНН КАК ОрганизацияИНН
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеСотрудников КАК ВТ_ДС
	//|	ПО Сотрудники.Наименование = ВТ_ДС.Наименование  	
	//	//|			И
	////|	ПО Сотрудники.Код = ВТ_ДС.КодСотрудника
	////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
	////|		ПО (СотрудникиДополнительныеРеквизиты.Ссылка = Сотрудники.Ссылка)
	////|			И (СотрудникиДополнительныеРеквизиты.Свойство = &Свойство)
	////|			И (СотрудникиДополнительныеРеквизиты.Значение = ИСТИНА)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	//|		ПО Сотрудники.ГоловнаяОрганизация = Организации.Ссылка
	//|			И (Организации.ИНН = &ИНН)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ОкончаниеПериода, ) КАК ФИОФизическихЛицСрезПоследних
	//|		ПО Сотрудники.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяДляУправления КАК РабочееВремяДляУправления
	//|		ПО (РабочееВремяДляУправления.Сотрудник = Сотрудники.Ссылка)
	//|			И (РабочееВремяДляУправления.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
	//|			И (РабочееВремяДляУправления.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.Явка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяСотрудников КАК РабочееВремяСотрудников
	//|		ПО (РабочееВремяСотрудников.Сотрудник = Сотрудники.Ссылка)
	//|			И (РабочееВремяСотрудников.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
	//|			И (РабочееВремяСотрудников.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.Явка))
	//|ИТОГИ ПО
	//|	ОрганизацияИНН,
	//|	Сотрудник";
	
	
	//ВыборкаСотр = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока ВыборкаСотр.Следующий() Цикл
	//	Выборка = ВыборкаСотр.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		а = 1;
	//	КонецЦикла;
	//КонецЦикла;
	ЗначениеВозврата = Ложь;
	Результат = Запрос.Выполнить();
	
	Текст = Неопределено;
	Каталог = КаталогВременныхФайлов()+"\";
	
	//КаталогОбмена = "\\192.168.30.111\ObmenLS$\LOG\ZIK\waybill\";
	КаталогОбмена = "D:\Denis\";
	
	
	ВыборкаОрганизация = Результат.Выбрать(в8.ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		ВыборкаСотрудник = ВыборкаОрганизация.Выбрать(в8.ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудник.Следующий() Цикл
			Текст = Неопределено;
			Выборка = ВыборкаСотрудник.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не ЗначениеЗаполнено(Выборка.Период) Тогда
					Если Сотрудники.найтиСтроки(Новый Структура("КодСотрудника",Выборка.КодСотрудника)).количество()  <> 0  тогда
						Сообщить("Нет данных для выгрузки по сотруднику "+Выборка.Фамилия+" "+Выборка.Имя);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				Если Текст = Неопределено Тогда
					ИмяФайла = СокрЛП(Выборка.ОрганизацияИНН)+"_"+Выборка.Фамилия+"_"+Выборка.Имя+"_"+Формат(НачалоМесяца(Выборка.Период),"ДФ=dd.MM.yy")+".txt";
					Текст = Новый ЗаписьТекста(Каталог+ИмяФайла,КодировкаТекста.ANSI);
				КонецЕсли;
				Если Выборка.Часы > 0 Тогда
					Текст.ЗаписатьСтроку(Формат(Выборка.Период,"ДФ=dd.MM.yy"));
				КонецЕсли;
			КонецЦикла;
			
			Если Текст <> Неопределено Тогда
				Текст.Закрыть();
				КопироватьФайл(Каталог+ИмяФайла,КаталогОбмена+ИмяФайла);
				//	Сообщить("Выгружен "+ИмяФайла);
				ЗначениеВозврата = истина;
				УдалитьФайлы(Каталог+ИмяФайла);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Если не ЗначениеВозврата тогда
		сообщить(Сотрудники[0].Наименование +" - не найден табель"  );
	КонецЕсли;	
	возврат ЗначениеВозврата
КонецФункции	

Процедура ЗаполнитьДокументуПоТабелю(ТекД)
	пл = ТекД.ПутевойЛист;
	Есть="";
	Если 	Организация.ИНН= "101207714"//Диома-М
		или Организация.ИНН = "190503808"//Итора
		или Организация.ИНН = "401163249"//Итора Филиал Гомель
		или Организация.ИНН = "701438317"//Итора Филиал Могилев
		или Организация.ИНН= "101454161"//ЛИБРЕТИК
		или Организация.ИНН= "191685239"//ЛибретикГрупп
		или Организация.ИНН = "191923668"//Наваколле
		или Организация.ИНН = "192121309"//Фудлогистик
		или Организация.ИНН = "191449024"//ЧистоМаг
		или Организация.ИНН = "101171198"//ЧИСТЫЕ РОДНИКИ
		или Организация.ИНН = "193139549"//Акинита
		или Организация.ИНН = "100230639" // Зорина
		или Организация.ИНН = "193631798" // БрайтСтор 
		тогда
		Сотр = новый ТаблицаЗначений;
		Сотр.Колонки.Добавить("Наименование", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
		Сотр.Колонки.Добавить("КодСотрудника",ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20));
		стсрС = Сотр.Добавить();
		стсрС.КодСотрудника = СокрЛП(ПЛ.Водитель.Код);
		стсрС.Наименование = СокрЛП(ПЛ.Водитель.Наименование);
		
		Если ПолучитьТабельСотрудника1с8ЗУП(Сотр,ПЛ.ДатаНачала,ПЛ.ДатаОкончания) тогда
			Есть = "Записан";	
		КонецЕсли;
		
	Иначе
		Если ЕстьПодключение=ложь тогда        
			ПодключитьБазу() ;
		КонецЕсли;
		Если ЕстьПодключение=Истина тогда
			ДатаНачала = ПЛ.ДатаНачала;
			Год = Формат(Год(ДатаНачала), "ЧН=0; ЧГ=");
			Месяц = Месяц(ДатаНачала);
			ТабНомСотр = СокрЛП(ПЛ.Водитель.Код);
			Есть =  База.EvalExpr("ПолучитьТабельСотрудника("""+ТабНомСотр+""","+Год+","+Месяц+")");
		КонецЕсли;	
	КонецЕсли;		
	
	Если Найти(Есть,"Записан")<>0 тогда
		ОбъектПЛ = ПЛ.получитьОбъект();
		Если  ОбъектПЛ.Автомобиль.пустая() тогда
			ОбъектПЛ.Автомобиль =      НайтиАвтомобильОСпоВодителю(ОбъектПЛ.Водитель.ссылка);
		конецЕсли;
		Если ОбъектПЛ.ВыполнениеЗадания.Количество() <> 0 Тогда
			Если (ПерераспределятьПроведенные и ОбъектПЛ.Проведен) или не ОбъектПЛ.Проведен тогда
				ОбъектПЛ.ВыполнениеЗадания.Очистить();
			Иначе
				Если Вопрос("Перезаполнить данные? таблица будет очищена! "+Строка(ОбъектПЛ),РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ОбъектПЛ.ВыполнениеЗадания.Очистить();
				КонецЕсли;
			конецЕсли;
		КонецЕсли;
		ДатаУвольнения="";
		ЗаполнитьИз1С_7_8_НаСервере(ОбъектПЛ,ДатаУвольнения);
		ТекД.ДатаУвольнения =ДатаУвольнения;
		ПересчетСпидометра(ОбъектПЛ);
		ОбъектПЛ.записать();
	иначе
		Сообщить(Есть+", карта № "+строка(ПЛ.Водитель));
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПересчетСпидометра(Объект, КорректироватьНачОстаток = Ложь, КорректироватьПройденноеРасстояние = Ложь)
	ОстатокТоплива = 0;КонечныйСпидометр = 0;
	ДопрРасходНачало=0;
	ДопрРасходНачало1=0;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Если Объект.ВыполнениеЗадания.Количество() > 0 Тогда
		Объект.ДопКолКМ = Объект.Автомобиль.Автомобиль.РасстояниеДоДома*2;
		ТекущаяСтрока = Объект.ВыполнениеЗадания[0];
		
		Если КорректироватьНачОстаток Тогда
			Если ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
				ТекущаяСтрока.КорректировкаНачальногоСпидометра = ГСЧ.СлучайноеЧисло(1, 5);
			Иначе
				ТекущаяСтрока.КорректировкаНачальногоСпидометра = ГСЧ.СлучайноеЧисло(7, 15);
			КонецЕсли;
		КонецЕсли;
		
		КоэфГород = ?(ТекущаяСтрока.РасходГород<>0, 1, 0); //20220320. Павел
		КоэфТрасса = ?(ТекущаяСтрока.РасходТрасса<>0, 1, 0);
		ТекущаяСтрока.РасстояниеГород =  (ТекущаяСтрока.РасходГород /Объект.РасходТоплива)*100;
		
		Если КорректироватьПройденноеРасстояние Тогда
			Если ТекущаяСтрока.РасстояниеГород > 200 Тогда
				ПоТрассе = ТекущаяСтрока.РасстояниеГород - 200;
				РасходГород200 = ТекущаяСтрока.РасходГород * 2;
				ТекущаяСтрока.РасходГород = РасходГород200;
				ТекущаяСтрока.РасстояниеГород = 200;
				ТекущаяСтрока.РасстояниеТрасса = ПоТрассе;
				ТекущаяСтрока.РасходТрасса = ТекущаяСтрока.РасстояниеТрасса * Объект.РасходТопливаТрасса / 100;
				ТекущаяСтрока.МаршрутКуда = "Трасса";
				ТекущаяСтрока.МаршрутОткуда = "Трасса";
			КонецЕсли;
		КонецЕсли;
		
		Если  Объект.ДопКолКМ = 0 тогда
			ДопрРасходНачало1 = 	Макс(рандом(10),Рандом(12));
		Иначе
			рр=1;
			пока ДопрРасходНачало=ДопрРасходНачало1 Цикл 
				Если РР%11 =0 тогда	
					прервать;
				КонецЕсли;	
				рр=рр+1;	
				ДопрРасходНачало1 = 	Макс(Мин(Объект.ДопКолКМ+рандом(2),Рандом(Объект.ДопКолКМ+1)),Рандом(Объект.ДопКолКМ))
			КонецЦикла;
		КонецЕсли;	
		
		Если ДопрРасходНачало=ДопрРасходНачало1 тогда
			ДопрРасходНачало =ДопрРасходНачало1+ рандом(1) ;
		Иначе 
			ДопрРасходНачало =ДопрРасходНачало1;
		КонецЕсли;
		
		//ТекущаяСтрока.РасстояниеГород =   Объект.РасходТоплива * (ТекущаяСтрока.Расстояние-ТекущаяСтрока.РасстояниеТрасса) / 100;
		//Если    Объект.НачальныйСпидометр=0 тогда
		Если КорректироватьНачОстаток Тогда
			Объект.НачальныйСпидометр = ПолучитьОстатокТоплева(Истина,Объект) + Объект.ДопКолКМ;
		Иначе
			Объект.НачальныйСпидометр = ПолучитьОстатокТоплева(Истина,Объект);
		КонецЕсли;
		
		//КонецЕсли;
		
		ТекущаяСтрока.НачальныйСпидометр = Объект.НачальныйСпидометр + ТекущаяСтрока.КорректировкаНачальногоСпидометра + Объект.ДопКолКМ;
		ТекущаяСтрока.КонечныйСпидометр = ТекущаяСтрока.НачальныйСпидометр + ТекущаяСтрока.РасстояниеГород +ТекущаяСтрока.РасстояниеТрасса;	
		ТекущаяСтрока.Расстояние  = ТекущаяСтрока.РасстояниеГород +ТекущаяСтрока.РасстояниеТрасса;
		
		//ТекущаяСтрока.РасходГород = Объект.РасходТоплива * (ТекущаяСтрока.Расстояние-ТекущаяСтрока.РасстояниеТрасса) / 100;
		//ТекущаяСтрока.РасходТрасса = Объект.РасходТопливаТрасса * ТекущаяСтрока.РасстояниеТрасса / 100; //20220305. Павел
		Если ТекущаяСтрока.РасстояниеТрасса <> 0 Тогда
			ТекущаяСтрока.МаршрутОткуда = "Трасса";
			ТекущаяСтрока.МаршрутКуда = "Трасса";
		Иначе
			ТекущаяСтрока.МаршрутОткуда = "Город";
			ТекущаяСтрока.МаршрутКуда = "Город";
		КонецЕсли;
		ТекущаяСтрока.РасходНорма = КоэфГород*ТекущаяСтрока.РасходГород + КоэфТрасса*ТекущаяСтрока.РасходТрасса; 
		ТекущаяСтрока.РасходФакт  = ТекущаяСтрока.РасходНорма;	
		ТекущаяСтрока.Перерасход  = ТекущаяСтрока.РасходФакт - ТекущаяСтрока.РасходНорма;
		ТекущаяСтрока.ОстатокТоплива  =ТекущаяСтрока.ОстатокТоплива;//ПолучитьОстатокТоплева(,Объект);//ОстатокТоплива;
		Объект.ОстатокТопливаНаНачало  =  ТекущаяСтрока.ОстатокТоплива;
		ТекущаяСтрока.ОстатокТоплива1 = ТекущаяСтрока.ОстатокТоплива + ТекущаяСтрока.Получено - ТекущаяСтрока.РасходФакт;
		
		Если УвеличиватьСпидометрВыходногоДня Тогда
			Если  ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье
				или ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота тогда
				ТекущаяСтрока.КонечныйСпидометр = ТекущаяСтрока.КонечныйСпидометр+Рандом(100,ТекущаяСтрока.ОстатокТоплива1,180);
			КонецЕсли;
		КонецЕсли;
		
		КонечныйСпидометр = ТекущаяСтрока.КонечныйСпидометр;
		ОстатокТоплива  = ТекущаяСтрока.ОстатокТоплива1;
	КонецЕсли;	
	
	Для п = 1  По Объект.ВыполнениеЗадания.Количество()-1 Цикл
		ТекущаяСтрока = Объект.ВыполнениеЗадания[п];
		
		Если КорректироватьНачОстаток Тогда
			Если ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
				ТекущаяСтрока.КорректировкаНачальногоСпидометра = ГСЧ.СлучайноеЧисло(1, 5);
			Иначе
				ТекущаяСтрока.КорректировкаНачальногоСпидометра = ГСЧ.СлучайноеЧисло(7, 15);
			КонецЕсли;
		КонецЕсли;
		
		КоэфГород = ?(ТекущаяСтрока.РасходГород<>0, 1, 0);
		КоэфТрасса = ?(ТекущаяСтрока.РасходТрасса<>0, 1, 0);
		
		Если Не РаспределятьАдаптивно Тогда
			
			Если  ТекущаяСтрока.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье
				и ТекущаяСтрока.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота тогда
				Если ТекущаяСтрока.РасходГород=0 и ОстатокТоплива>5 тогда
					ТекущаяСтрока.РасходГород = Рандом(2)	
				конецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекущаяСтрока.РасстояниеГород =  (ТекущаяСтрока.РасходГород /Объект.РасходТоплива)*100; //* (ТекущаяСтрока.Расстояние-ТекущаяСтрока.РасстояниеТрасса) / 100;
		
		Если КорректироватьПройденноеРасстояние Тогда
			Если ТекущаяСтрока.РасстояниеГород > 200 Тогда
				ПоТрассе = ТекущаяСтрока.РасстояниеГород - 200;
				РасходГород200 = ТекущаяСтрока.РасходГород * 2;
				ТекущаяСтрока.РасходГород = РасходГород200;
				ТекущаяСтрока.РасстояниеГород = 200;
				ТекущаяСтрока.РасстояниеТрасса = ПоТрассе;
				ТекущаяСтрока.РасходТрасса = ТекущаяСтрока.РасстояниеТрасса * Объект.РасходТопливаТрасса / 100;
				ТекущаяСтрока.МаршрутКуда = "Трасса";
				ТекущаяСтрока.МаршрутОткуда = "Трасса";
			КонецЕсли;
		КонецЕсли;
		
		Если  Объект.ДопКолКМ = 0 тогда
			ДопрРасходНачало1 = 	Макс(рандом(10),Рандом(12));
		Иначе
			рр=1;
			пока ДопрРасходНачало=ДопрРасходНачало1 Цикл 
				Если РР%11 =0 тогда	
					прервать;
				КонецЕсли;	
			рр=рр+1;	
			ДопрРасходНачало1 = 	Макс(Мин(Объект.ДопКолКМ+рандом(2),Рандом(Объект.ДопКолКМ+1)),Рандом(Объект.ДопКолКМ))
			КонецЦикла;
		КонецЕсли;	
		 Состояние(ДопрРасходНачало);
		Если ДопрРасходНачало=ДопрРасходНачало1 тогда
			ДопрРасходНачало =ДопрРасходНачало1+ рандом(1) ;
		Иначе 
			ДопрРасходНачало =ДопрРасходНачало1;  
		КонецЕсли;	
		
		//ТекущаяСтрока.НачальныйСпидометр = КонечныйСпидометр + ?(ТекущаяСтрока.РасходГород+ТекущаяСтрока.РасстояниеТрасса<>0, ДопрРасходНачало,0) + ТекущаяСтрока.КорректировкаНачальногоСпидометра;
		
		ТекущаяСтрока.НачальныйСпидометр = КонечныйСпидометр + ТекущаяСтрока.КорректировкаНачальногоСпидометра + Объект.ДопКолКМ;
		
		ТекущаяСтрока.КонечныйСпидометр = ТекущаяСтрока.НачальныйСпидометр + ТекущаяСтрока.РасстояниеГород +ТекущаяСтрока.РасстояниеТрасса;	
		ТекущаяСтрока.Расстояние  = ТекущаяСтрока.РасстояниеГород +ТекущаяСтрока.РасстояниеТрасса;
		//ТекущаяСтрока.РасходГород = Объект.РасходТоплива * (ТекущаяСтрока.Расстояние-ТекущаяСтрока.РасстояниеТрасса) / 100;
		//ТекущаяСтрока.РасходТрасса = Объект.РасходТопливаТрасса * ТекущаяСтрока.РасстояниеТрасса / 100; //20220305. Павел
		Если ТекущаяСтрока.РасстояниеТрасса <> 0 Тогда
			ТекущаяСтрока.МаршрутОткуда = "Трасса";
			ТекущаяСтрока.МаршрутКуда = "Трасса";
		Иначе
			ТекущаяСтрока.МаршрутОткуда = "Город";
			ТекущаяСтрока.МаршрутКуда = "Город";
		КонецЕсли;
		ТекущаяСтрока.РасходНорма = КоэфГород*ТекущаяСтрока.РасходГород + КоэфТрасса*ТекущаяСтрока.РасходТрасса; 
		ТекущаяСтрока.РасходФакт  = ТекущаяСтрока.РасходНорма;	
		ТекущаяСтрока.Перерасход  = ТекущаяСтрока.РасходФакт - ТекущаяСтрока.РасходНорма;
		ТекущаяСтрока.ОстатокТоплива  = ОстатокТоплива;
		ТекущаяСтрока.ОстатокТоплива1 = ТекущаяСтрока.ОстатокТоплива + ТекущаяСтрока.Получено - ТекущаяСтрока.РасходФакт;
		
		Если УвеличиватьСпидометрВыходногоДня Тогда
			Если  ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье
				или ТекущаяСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота тогда
				ТекущаяСтрока.КонечныйСпидометр = ТекущаяСтрока.КонечныйСпидометр+Рандом(100,ТекущаяСтрока.ОстатокТоплива1,180);
			КонецЕсли;
		КонецЕсли;
		
		КонечныйСпидометр = ТекущаяСтрока.КонечныйСпидометр;
		ОстатокТоплива  = ТекущаяСтрока.ОстатокТоплива1;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьОстатокТоплева(Спидометр=Ложь,Объект)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПутевойЛист.Ссылка,
	|	ПутевойЛист.Дата КАК Дата
	|ПОМЕСТИТЬ Путевые
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.ДатаОкончания < &Дата
	|	И ПутевойЛист.Автомобиль = &Автомобиль
	|	И ПутевойЛист.Организация = &Организация
	|	И ПутевойЛист.ГосНомер = &ГосНомер
	//  |	И ПутевойЛист.ТабНомер = &ТабНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПутевойЛистВыполнениеЗадания.КонечныйСпидометр,
	|	ПутевойЛистВыполнениеЗадания.ОстатокТоплива1 КАК Остаток
	|ИЗ
	|	Путевые КАК Путевые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПутевойЛист.ВыполнениеЗадания КАК ПутевойЛистВыполнениеЗадания
	|		ПО Путевые.Ссылка = ПутевойЛистВыполнениеЗадания.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПутевойЛистВыполнениеЗадания.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Дата",Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Автомобиль",Объект.Автомобиль);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ГосНомер",Объект.ГосНомер);
	//Запрос.УстановитьПараметр("ТабНомер",Объект.ТабНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Спидометр Тогда
		Если Выборка.Следующий() Тогда
			Возврат Выборка.КонечныйСпидометр;
		Иначе
			Возврат Объект.НачальныйСпидометр;
		КонецЕсли;
	КонецЕсли;
	Если Выборка.Следующий() И (Объект.ОстатокТопливаНаНачало = 0) Тогда	
		Возврат ?(-0.5<=Выборка.Остаток и Выборка.Остаток<=0.5,0, Выборка.Остаток);	
	КонецЕсли;	
	Возврат Объект.ОстатокТопливаНаНачало;
	
КонецФункции



Процедура ЗаполнитьИз1С_7_8_НаСервере(Объект,ДатаУвольнения="")
	МассивДат = Новый СписокЗначений;
	//Если Не ЗначениеЗаполнено(УНПОрганизации) Тогда
	УНПОрганизации = СокрЛП(Объект.Организация.ИНН);
	//КонецЕсли;
	ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(, Новый Структура("ФизЛицо",Объект.Водитель));
	
	пФамилия  = ФИОСрез.Фамилия;
	пИмя      = ФИОСрез.Имя;
	пОтчество = ФИОСрез.Отчество;
	Если Не ЗначениеЗаполнено(пФамилия) Тогда
		Сообщить("Не обнаружено ФИО для физического лица "+Объект.Водитель);
		Возврат;
	КонецЕсли;
	
//	Имяфайла = УНПОрганизации + "_"+пФамилия+"_"+Формат(НачалоМесяца(Объект.ДатаНачала),"ДФ='dd.MM.yy'")+".txt";
//	МассивФайлов = НайтиФайлы(КаталогЗагрузки+Имяфайла);

//1с8
	Имяфайла = УНПОрганизации + "_"+пФамилия+"_"+пИмя+"_"+Формат(НачалоМесяца(Объект.ДатаНачала),"ДФ='dd.MM.yy'")+".txt";
	МассивФайлов = НайтиФайлы(КаталогЗагрузки+Имяфайла);
	Если Не МассивФайлов.Количество() Тогда
		//только по фамилии / для 1с8
		Имяфайла = УНПОрганизации + "_"+пФамилия+"_"+"*"+Формат(НачалоМесяца(Объект.ДатаНачала),"ДФ='dd.MM.yy'")+".txt";
		МассивФайлов = НайтиФайлы(КаталогЗагрузки+Имяфайла);
	КонецЕсли;
	Если Не МассивФайлов.Количество() Тогда
		//только по фамилии / для 1с7
		Имяфайла = УНПОрганизации + "_"+пФамилия+"_"+Формат(НачалоМесяца(Объект.ДатаНачала),"ДФ='dd.MM.yy'")+".txt";
		МассивФайлов = НайтиФайлы(КаталогЗагрузки+Имяфайла);
	КонецЕсли;


Если МассивФайлов.Количество() Тогда
		МассивДат.Очистить();
		Текст = Новый ЧтениеТекста(МассивФайлов[0].ПолноеИмя,КодировкаТекста.ANSI);
		стр = Текст.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			Массив =	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"~");
			Попытка
			День = Число(Лев(Массив[0],2));
			Месяц = Число(Сред(Массив[0],4,2));
			Год = Число(Прав(Массив[0],2));
			ДатаУвольнения=Дата(1,1,1);
			Если Массив.количество()>1 Тогда
				Если  Массив[1]<>".  ."  тогда
					ДеньУ = Число(Лев(Массив[1],2));
					МесяцУ = Число(Сред(Массив[1],4,2));
					ГодУ = Число(Прав(Массив[1],2));
					ДатаУвольнения = 	Массивдат.Добавить(Дата(2000+ГодУ,МесяцУ,ДеньУ));
				КонецЕсли;
			КонецЕсли;
			
			
			//	День = Число(Лев(стр,2));
			//	Месяц = Число(Сред(Стр,4,2));
			//	Год = Число(Прав(стр,2));
			Исключение
			КонецПопытки;
			Массивдат.Добавить(Дата(2000+Год,Месяц,День));
			
			стр = Текст.ПрочитатьСтроку()
		КонецЦикла;
		Текст.Закрыть();
		
		Сообщить("Загружен файл "+Имяфайла);
		УдалитьФайлы(КаталогЗагрузки+Имяфайла);
		
	Иначе
		Сообщить("Не найден файл для загрузки "+КаталогЗагрузки+Имяфайла);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере("1С7",Объект);
	
КонецПроцедуры

Функция  ВыполнитьЗапросПроизвКалендаря(Объект)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Водитель",Объект.Водитель);
	Запрос.Текст = "ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня,
	|	&Водитель КАК Водитель,
	|	""По городу"" КАК МаршрутОткуда,
	|	""По городу"" КАК МаршрутКуда
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНач И &ДатаКон";
	возврат Запрос.Выполнить().Выгрузить();
КонецФункции	


Процедура ЗаполнитьНаСервере(ИмяКоманды = Неопределено,Объект)
	Объект.ВыполнениеЗадания.Загрузить(ВыполнитьЗапросПроизвКалендаря(Объект));
	Если ИмяКоманды = "Заполнить33" Тогда
		ит = 0;
		Для Каждого стр из Объект.ВыполнениеЗадания Цикл
			пДень = Ит % 6 + 1;
			Если пДень <= 3 Тогда
				стр.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
			Иначе
				стр.ВидДня = ?(ДеньНедели(стр.Дата) = 6,Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота,перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
			КонецЕсли;
			Ит = Ит + 1;
		КонецЦикла;
	ИначеЕсли ИмяКоманды = "1С7" Тогда
		Для Каждого стр из Объект.ВыполнениеЗадания Цикл
			Если МассивДат.НайтиПоЗначению(стр.Дата) = Неопределено Тогда
				стр.ВидДня = ?(ДеньНедели(стр.Дата) = 6,Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота,перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
			Иначе
				стр.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры




Процедура ОсновныеДействияФормыДействие(Кнопка)
	Если ЕстьПодключение=ложь тогда        
		ПодключитьБазу() ;
	КонецЕсли;
	Если ЕстьПодключение=Истина тогда
		Сообщить("Все хорошо! пподключение есть")
	КонецЕсли;
	//ЗаполнитьДокументуПоТабелю( ЭлементыФормы.карты.ТекущиеДанные.ПутевойЛист)
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	v77_РазорватьСвязь (База);
	в8 = Неопределено;
	Подключено = Неопределено;

КонецПроцедуры


Процедура ВставитьВпутевыеНажатие(Элемент)
	//для каждого к=0 из ЗаправкиНеРаспределенные цикл 
	ЭтоДоставщик = справочники.КатегорииЗастрахованныхЛиц.НайтиПоНаименованию("Доставка");

	КК=0;
	Пока КК<=ЗаправкиНеРаспределенные.Количество()-1 Цикл
		стр = ЗаправкиНеРаспределенные[КК]	;
		Если стр.ПутевойКудаРаспределить.Пустая() тогда
			КК=КК+1;
			Продолжить;
		конецЕсли;	
		Есть=ложь;
		ТЗпл = стр.ПутевойКудаРаспределить.ВыполнениеЗадания.Выгрузить();
		//отбор = Новый Структура("НомерЭК,Период",стр.НомерЭК,стр.Период);
		//стрЗаправки = Заправки.НайтиСтроки(отбор); 
		//Для каждого стрЗ из стрЗаправки цикл
		отборПЛ = Новый Структура("Дата",стр.Дата);
		стрПЛ = ТЗпл.НайтиСтроки(отборПЛ);
		для каждого сПЛ из стрПЛ цикл
			
			//Если ИсключатьВыходные =  Истина тогда
			//	Если  сПЛ.ВидДня <>  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий тогда
			//		
			//		СледДень = ТЗпл[Мин(ТЗпл.индекс(Спл)+1,ТЗпл.Количество()-1)];
			//		еСЛИ СледДень.ВидДня =  Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий И  стрЗ.Время>22 ТОГДА
			//			/// Заправился в выходной вечером- следующий день рабочий;	
			//		иначе	
			//			
			//			Если стрЗ.получено <>0 Тогда
			//				Состояние(строка(стрЗ.Дата) + " - нарушение УК РБ ст. № "+ Строка(стр.ПутевойЛист) );
			//				стрЗР =	ЗаправкиНеРаспределенные.Добавить();
			//				стрЗР.Автомобиль = стрЗ.Автомобиль;
			//				стрЗР.Водитель =стрЗ.Водитель;
			//				стрЗР.Дата = стрЗ.Дата;
			//				стрЗР.ГСМ = стрЗ.ГСМ;
			//				стрЗР.НомерЭК = стрЗ.НомерЭК;
			//				стрЗР.Период=   стрЗ.Период;
			//				стрЗР.Получено = стрЗ.Получено; 
			//				НайтиПодходящиеПутевыеДляНераспределенных(стрЗР)    ;
			//			КонецЕсли;	
			//			
			//			Продолжить;
			//		КонецЕсли;	
			//	КонецЕсли;	    
			//КонецЕсли;	
			
			// Колодко Дмитрий Александрович 652014616 проверку 04.06.2022
			Если   сПЛ.Получено+стр.Получено>50 и ЭтоДоставщик = сПЛ.Водитель.СтатусКатегория тогда
				
			иначе	
			//Если сПЛ.Получено=0 Тогда
				отборЗ = Новый Структура("НомерЭК,Период,Дата",стр.НомерЭК,стр.Период,стр.Дата);
				стрЗаправки = Заправки.НайтиСтроки(отборЗ); 
				Для каждого стрЗ из стрЗаправки цикл
					стрЗ.ПутевойЛист =  стр.ПутевойКудаРаспределить;
				конецЦикла;	
				
				
				сПЛ.Получено =сПЛ.Получено+  стр.Получено;
				Есть=истина;
			конецЕсли;
		КонецЦикла;
		//	КонецЦикла;
		Если Есть тогда
			об =  стр.ПутевойКудаРаспределить.ПолучитьОбъект();
			об.ВыполнениеЗадания.Загрузить(ТЗпл);
			об.Записать();  
			
			ЗаправкиНеРаспределенные.Удалить(КК);
			кк=кк-1;
		КонецЕсли;
		кк=кк+1;
	КонецЦикла;	
	для каждого стр из Карты цикл
		стр.ПолученоРаспределено= стр.ПутевойЛист.ВыполнениеЗадания.Итог("Получено");
	конецЦикла;
	ЭлементыФормы.Карты.Колонки.Получено.ТекстПодвала = Карты.Итог("Получено");
	ЭлементыФормы.Карты.Колонки.ПолученоРаспределено.ТекстПодвала = Карты.Итог("ПолученоРаспределено");
	ЭлементыФормы.ЗаправкиНеРаспределенные.Колонки.Получено.ТекстПодвала = ЗаправкиНеРаспределенные.Итог("Получено");
	 ВсегоРаспределенео=0;
	 Для каждого стрЗ из Заправки цикл
		 Если не стрЗ.ПутевойЛист.Пустая() тогда
		 ВсегоРаспределенео=ВсегоРаспределенео+стрЗ.Получено;
		 КонецЕсли;

	конецЦикла;	
	
	//ЭлементыФормы.Заправки.Колонки.ПутевойЛист.ТекстПодвала =  ВсегоРаспределенео;
	ОбновитьПодвалЗаправкиПолучено();
	
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ЗаправкиПолученоАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КоманднаяПанель1ОтчетПоПолученномуТопливу(Кнопка)
	
	Если Заправки.Количество() > 0 Тогда
		
		ТЗДляОтчета = Новый ТаблицаЗначений;	
		ТЗДляОтчета = Заправки.Выгрузить(,"НомерЭК,Водитель,Получено,Сумма");
		ТЗДляОтчета.Свернуть("Водитель,НомерЭК,","Получено,Сумма");
		ТЗДляОтчета.Сортировать("Водитель");
		
		ТабДок = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("СводныйОтчет");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока    = Макет.ПолучитьОбласть("Строка");
		ОбластьИтого     = Макет.ПолучитьОбласть("Итого");
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Для каждого Строка Из ТЗДляОтчета Цикл
		
			ОбластьСтрока.Параметры.Заполнить(Строка);		
		    ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла; 
		
		ОбластьИтого.Параметры.ИтогоПолучено = ТЗДляОтчета.Итог("Получено");
		ОбластьИтого.Параметры.ИтогоСумма    = ТЗДляОтчета.Итог("Сумма"); 
		
		ТабДок.Вывести(ОбластьИтого);
		
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб = Истина;
		
		ТабДок.Показать("Сводный отчет по заправкам");
				
	Иначе
		
		Сообщить("Сначала нужно загрузить файл с информацией о заправках");	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте

 Процедура ОбновитьПодвалЗаправкиПолучено()

	 ПостроительЗапроса = Новый ПостроительЗапроса; 
	 ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Заправки); 
	 Для Каждого ЭлементОтбора из ЭлементыФормы.Заправки.ОтборСтрок Цикл
		 ЗаполнитьЗначенияСвойств(ПостроительЗапроса.Отбор.Добавить(ЭлементОтбора.Имя), ЭлементОтбора);
	 КонецЦикла; 
	 ИтогТаблицаЗначений = ПостроительЗапроса.Результат.Выгрузить();

     ЭлементыФормы.Заправки.Колонки.Получено.ТекстПодвала = ИтогТаблицаЗначений.Итог("Получено");
                 	 
  КонецПроцедуры
